[
  {
    "id": 1,
    "header": "﻿IDEAS:",
    "content": "Introduction\n        We’re about to enter the bulk of this course where we talk about marketing, which is the main work of dropshipping. But before we get into that, it’s extremely important that you get your mind right. I understand that a lot of people view “mindset” as some cliche and overhyped topic, but as someone who has applied themself to learning all about this stuff, I can tell you it’s absolutely necessary to get your mind right. In this chapter I will cover what mindset you need to have, how gratitude will be your best friend, and the importance of discipline. I’ve also thrown in some bonus content for you at the end that I think you’ll love.",
    "category": "Mindset",
    "source": "course"
  },
  {
    "id": 2,
    "header": "Section 1, Believing You Are Worthy",
    "content": "So why is faith and trust in the process so important to your success with dropshipping? I’ll give you an example. Let’s say you’ve been going through this course and up to this point, you’ve been unsure if this stuff even works, you’re thinking that maybe Mike and I got lucky, and you’re thinking that if you do somehow succeed at dropshipping that it’ll have to be luck. Fair enough, it’s easy to feel these things at first. But now let’s think about the opposite. Let’s say that you’ve been going through this course, and up to this point, you’ve been telling yourself things like “Mike and Dom are no different than me, I can do this too”, and “I know that every business model works, and to succeed I just have to work hard and stay consistent”, and “I understand that if I fully devote myself to this, there’s no way that over a long enough period of time I don’t make money.” Notice the difference? It’s absolutely vital that you truly believe that this path is one that you will successfully walk, if that’s what you want. So many people cap their self growth and therefore the growth of their business by telling themselves that they aren’t worthy of what they truly want, and they do this subconsciously. If you think this may be you, I have a great example of a person raising their self belief ceilings that I’d like you to hear and learn something from. Luke Belmar, a regular man turned multi millionaire  through dropshipping and crypto, went onto “The Nonchalant Podcast” with Biaheza and explained why he believes that $10,000/day isn’t a lot of money for a person to be making. Sounds ridiculous, right? Not really, when you hear how he explains it. Luke knows that $10,000 per day is an amazing amount of money for anyone, except for maybe the King of Dubai. However, let’s say that one of his businesses gets to the point of making $5,000 per day, and he’s never made that much money in the duration of his entire life, let alone in a day. He’d probably view that money as the end all be all, the absolute pinnacle of his business, and probably not feel the need to scale any higher. I mean, could you blame him? He’s already at the tippity top of the highest mountain he could’ve ever imagined. But let’s say he got to that $5,000/day mark in his business, but up to that point he’d been tricking his mind a bit into thinking that $10k per day is the norm. Then he’d still have a fire under him, pushing him to get to that point in his business. So do you see how by believing that $10k a day is normal and not putting it on a pedestal, it becomes easier to get there? By tricking yourself to normalize this type of success and understanding that you are the type of person who is worthy of that type of success, it becomes easier to achieve it. So don’t cap yourself mentally. Understand that if you’re already here and you’ve made it this far into this course that you are special. Think about all the other people at your high school, your university, or the people in your family. Are they grinding through some dropshipping course? No way, they wouldn’t have the discipline for it and they probably don’t even know what dropshipping is. You found this course for a reason and are more likely to succeed than probably everyone you know. And you’re no different from Mike and I, you’re just starting a bit later than us. So recognize that you’re the exact person cut out to succeed in this.",
    "category": "Mindset",
    "source": "course"
  },
  {
    "id": 3,
    "header": "Section 3, Discipline",
    "content": "Alongside gratitude is discipline. These two practices are the two punch combo that you need to have in your mind if you want to succeed in this business. I’ll tell you right now that it’s very unlikely that the first video you post or the first ad campaign you launch will be a tremendous hit that prints you thousands of dollars. So what’s more likely to happen? You’ll fail, get a little win, fail again, then get a little bit of a bigger win, and so on. And you need to know that the path to success is really just a lot of failing. You fail your way to success. And in order for you to be able to stay consistent through those failures and stick with this each and every day, you need discipline. Discipline to do the things you know that you have to do, especially when you don’t want to do them. A great example is one of our students from our Discord group TRUST named Alex. Alex joined us and had high aspirations to succeed with dropshipping, but it took him 5-6 products to see one actually pop off. And when I say 5-6 products, I mean a couple months of running products with basically no success. Maybe a sale here and there before he found his winner. But when he did find his winning product, he did $1k days back to back. On calls with him, Mike and I would tell him that he had potential, only by judging the quality of his videos, and that if he stayed consistent results were sure to come. And that’s exactly what he did. He battled through the 200 view curse multiple times, which, if you don’t know, is basically where every video you post gets about 200 views. No higher, no lower. And you can be stuck in this range for quite some time. But Alex relied on his discipline to keep him consistent and had a video break half a million views which resulted in those huge sales. Would he have even come close to that if he had no discipline, and quit dropshipping after 2 products? No, of course not. And I have the same story myself, it took me a couple months to actually make money with dropshipping (which is actually very long, most people succeed wayy quicker), but because of my natural discipline and ability to stay consistent I pushed through that and obviously here I am now.\n        So you know that you need discipline, but if you don’t have it, how can you develop it? What you can do is just set out to get done what you know you have to get done each and every day, how much or how little that may be. By successfully completing every task that you told yourself you would do, you’re practicing keeping promises with yourself and you know that you are the type of person who does what they say they will do. After doing this long enough, it becomes your identity, and you are simply a person who stays consistent, stays disciplined and does what they know they should do. That’s exactly how I developed my discipline, and I’ll tell you that the more you practice, the more the energy snowballs and it becomes easier to do those same things that may have been hard to do before. Whether that’s doing all of your schoolwork, going to the gym, eating right, etc. So know that by developing discipline you are setting yourself up with a much better chance of actually succeeding in this business.",
    "category": "Mindset",
    "source": "course"
  },
  {
    "id": 4,
    "header": "Section 4, Bonus Practice",
    "content": "This wouldn’t be a Dom Dei chapter if I didn’t mention my favorite books that have helped me develop my mindset and discipline. And if you’re not a “book person” or a “reader”, I never was either but it gets addicting and these are some necessary reads for you. If you can read just 10 pages of a self-help book everyday, that compounds to over 3.6 thousand pages read, written from writers who are more insightful, smarter, more powerful, wealthier, and more experienced than you and I. And that’s exactly what my favorite book of all time, “The Slight Edge” by Jeff Olson explains. Jeff not only writes about how our actions compound, but he teaches us about the success curve. What is that exactly? I’ll give you an example. When we’re desperate for money and for example need to make rent, we bust our asses. But after enough ass busting we get to a point where we aren’t struggling so much anymore thanks to all of that hard work that we did, so we begin to relax. But when we relax, we slowly slip back to the point where we have to get back to ass busting. Jeff tells us that those same actions that we took to get from surviving to being comfortable are the same actions that take us from comfortable to greatness. This has been undoubtedly the most powerful book I’ve read in my life and it’s taught me that our dream lives all stem from the philosophy that you create and follow in your mind. So you’re going to read any of the books I’m about to give you, it should be this one. I absolutely love this book and know that it will provide you with such an insight to achieving success. Two books I’ll recommend to you for habit building are “The 7 Habits of Highly Effective People” by Stephen Covey and “Atomic Habits” by James Clear. Both of these were great reads in my opinion and I was able to learn how your habits directly reflect what your life looks like. Then the last 2 books I have for you when it comes to putting your mind on the right frequency to attract riches, health, and happiness are “Think and Grow Rich” by Napoleon Hill and “Manifest” by Roxie Nafousi. Think and Grow Rich is amazing because it perfectly explains how everything in this world operates at a frequency, including money and success, and how it’s absolutely necessary to place yourself on the frequency of whatever it is that you’d like to attract. I’ll give you an example if you’re skeptical of these “frequencies” and “vibrations.” If you were to drive 15 minutes from your house to mine, and when you got here I asked you if you saw a red car on your way here, you would say, “I don’t know, probably. I wasn’t really keeping an eye out for red cars.” But if you decided that on that 15 minute drive over here that your goal was to find as many red cars as possible, you would have found lots of them and you might even be able to tell me the exact amount of red cars that you saw on your way here. It’s the exact same thing with success, opportunities, networking, and more. For example, I went on a trip to Cabo with 6 of my boys and I could have easily just been having a good time and going up to girls, which of course we did, but because I’ve trained myself to always be on the lookout for “red cars'' I still had it ingrained in me. This paid off when we were on our way into one of the higher end resorts in Cabo. I saw a strong looking man with a shirt with LIVIN branding on it, the company that was hosting the event at that high end resort that we were going to. I also had noticed that he got out of a truck that had this LIVIN branding on it. I noticed that he was wearing nice clothes and I could just feel that he was a man of importance. Because of this I went up to him and simply said, ‘you look like a pretty important guy with LIVIN, what’s your role in the company?’ and he told me that he was actually the owner of it. From there we got to talking about how he enjoys running that type of business, what he’s learned, how he’s liked living in Cabo for the last 15 years, and much more. But let me ask you something. If I were in complete party mode when I was in Cabo, would I ever have made that networking connection? Would I have cared to go up to the guy and talk about what he does and learn some valuable lessons? Of course not. So this is what I mean when I say that it’s important to place yourself on the frequency of money and opportunity. Especially in your everyday life, if you’re on vacation you can relax, but I’m just extreme about it. Be aware of opportunity though, and be looking for it. Because you’ll notice that there’s always infinite opportunity around you, when you’re ready to receive it. An example of this that you can try for yourself is this: you don’t have to stop scrolling on TikTok or Instagram reels, but when you scroll, do so consciously. Take note of what videos really grab your attention and why. Ask yourself what made you send a certain video to a certain friend, and once you start getting a feel for why you’re acting how you are, you can implement it into the marketing of your dropshipping store and you’ll likely see better results. You don’t even have to write down these things that you’re noticing, I just want you to gain awareness of it. Now when I break it down like that isn’t it easy to understand how you make more money when you put yourself on the frequency of success and opportunity? I’m telling you, this manifesting and hippie frequency stuff isn’t made up.",
    "category": "Mindset",
    "source": "course"
  },
  {
    "id": 5,
    "header": "Manifest by Roxie Nafousi can be put simply. It teaches you that manifestation is simply this: you clearly state your goal, then continuously envision yourself as if you already have achieved that goal, and from there just take the necessary steps in order to actually achieve what you set out to do. For example, my current mantra is “I am a millionaire because I have the skills of a millionaire and conduct myself as one.” And I have it taped on my wall right in front of me here. I’m technically not a millionaire yet, but by seeing this message everyday while I work, I remind myself that I have the skills of a millionaire, I’m as disciplined as one, work as hard as one, am as confident as one, so therefore, I actually am a millionaire in lots of ways. By truly believing that I’m a millionaire, I’m able to get there faster than if I still lived and thought like a broke person. But by doing all the things that millionaires do and believing that because of those actions you are one, you will naturally possess all traits of a millionaire with time, including net worth. Again, it’s very simple when you break it down.",
    "content": "To close out this section I’ve gathered some videos that are great for motivation. Because although we don’t want to rely on motivation to get us up and going at our goals, it’s still a very valuable tool. The first video I have is Iman Gadzhi buying his mom her dream house. This is a beautiful video of Iman talking about his story and how he promised his mom that he would one day buy her her dream house, then how he built his businesses to the point where he actually bought her the dream house. Manifestation at its core. Then I have these 3 success story videos. From Robert Oliver, Jordan Welch, and Iman Gadzhi again. These 3 videos will get you so motivated to get up off your ass and just go for it. Then finally, I have 2 Biaheza videos. What’s funny is that these videos weren’t made at all to be motivational, it’s not some success story that gets you emotional or anything. But his 2 videos on making a subscriber rich and his brand building speedrun show you how easy this game can really be, and it just gets you so excited to work. Almost like how you watch your favorite quarterback play then at halftime you just wanna go outside and throw the football. So I recommend keeping these videos in your back pocket if you ever need that extra boost.",
    "category": "Mindset",
    "source": "course"
  },
  {
    "id": 6,
    "header": "Iman Gadzhi Recording Entire Life",
    "content": "[a][b][c]Before you leave this chapter on mindset I have 2 very powerful, personal stories that I want to share with you to prove to you that manifesting will get you to where you want to be in life quicker. The first one is this: all of high school I wanted a white 4runner. Before I had even started even making any money, it was the exact car that I wanted. I thought about it all the time, I noticed every white 4runner that drove by me on the road, and I may have even had one as my wallpaper on my phone at one point. This wasn’t necessarily my “dream car”- that would probably be some insane blacked out BMW, but the 4runner was a really solid SUV that I was pretty obsessed with. And the whole time that I wanted this 4runner i was driving around a pretty crappy silver vokswagen jetta. So I have something I want to share with you from when i was in high school. In this video of me walking into the gym before school, I film this 4runner and say “yeah, this is what I want.” Take a listen- [PLAY VIDEO] What’s crazy though is that I completely forgot that I had taken this video until 2 years later when, guess what? I had bought my white 4runner in cash and it was sitting in the driveway… So take this as proof that when you want something so terribly and you put your head down and start grinding extremely hard for it, it’s very likely to come into your life. \n        I’ll make this last story quick because I’m sure you’re excited now to get to the next chapter, but this will apply to you even more. In May of 2023 Mike and I started posting to our personal brand TikTok accounts, hoping to blow up and lead people to join our Discord group “TRUST.” But for whatever reason, nothing was giving. We were both posting 3 high quality videos to our accounts for over a month and a half, the whole time being stuck in the 200 view curse. At this point I wasn’t so into manifestation but I thought to myself that I should try again because I needed an extra boost, nothing was going our way. So after journaling and posting for a few days, I felt a strong urge that something was going to give soon. I’m not even making this up for the story, I could literally sense that something was going to give. So on July 20th, I wrote this journal entry: “I know that one of my personal TikTok accounts will blow up soon. I know that one video is going to explode, bring up all my other videos with it, and so many people are going to follow because they see the consistent, great quality videos that I put out. I know that it’s simply a matter of consistency and integrity that will get me to this point, and I’m so ready. I can literally feel the account bubbling, ready to explode…” “I don’t know exactly when this is going to happen, but I know that it is going to be very soon. It could be this next video, or the one after that or maybe 10 videos down the line. But I do know that I am going to do everything in my power to make sure that happens.” So what happened to the very next video that I posted after that journal entry? It got 2.2 MILLION views. So again, getting a clear image of exactly what you want to achieve then working as hard as you can to get it has never failed me and I doubt it’ll fail you. I hope that you’re even more excited to keep grinding through this course now, and I hope that you take this mindset with you into it that way you’re more likely to succeed.",
    "category": "Mindset",
    "source": "course"
  }
]