[
  {
    "id": 1,
    "header": "Part 1 - Introduction",
    "content": "In Chapter 4 I’ll be covering everything you would possibly need to know about products. This will be a big chapter because in dropshipping, you could do everything right but have a poor product and not get any results. We’ll cover the things that you should look for in a product, I’ll give you examples of winners and losers, I’ll show you how to find these products, and I’ll give you lots of pointers and overall good things to know.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 2,
    "header": "Part 2 - Product Criteria, Wow Factor",
    "content": "So what do we have to see in a product to determine it’s a winning product? And what do I even mean when I say “winning product?” Well it’s really simple, a winning product is simply a product that sells well, converts well, and overall just makes you a good amount of money. It’s funny how we say winning product but never losing product, but I guess a “losing product” would just be the opposite. A product that doesn’t check any of the boxes, so we don’t even bother trying to sell it. Or it checks some/all of the boxes, but when we put it to the test and actually try to sell it, it doesn’t succeed. Now that we’re on the same page, what winning product criteria do we look for? With me I have the “big 4” boxes that we like to see checked, and I’ll go through them 1 by 1 with you.[a] The first one is a visual wow factor. What this means is that the product has some sort of “scroll stopping feature,” it’s something that makes people say wow, it’s a unique and interesting product. For example, what doesn’t have a wow factor is this lighter right here. Everyone’s seen one before, there’s absolutely nothing special about it. If you were to make content for this lighter, the product wouldn’t grab a single person’s attention in any way. A lighter with a wow factor though would be something like this dragon lighter that looks like it’s spitting flames. It’s in a crisp gold color, and leans up with a huge flame coming out of its mouth. I will say though, this specific product has lost some of the wow factor that it used to have because this product just became so saturated over time. But what do I mean by that? What I mean is that since the dragon lighter had such a good wow factor with the tilted dragon and the big flame, dropshippers all started hopping on the product and selling it. Which makes sense, because a strong wow factor is a big green flag in a product. However, this made the market for people who would actually buy this product dry up, and so many people were starting to see it. So if we think about seeing this lighter for the first time, you would definitely be intrigued by it, thinking ‘wow, what a crazy lighter,’ it’s gold, has a huge flame, it’s pretty cool. But after seeing it 4-5 more times on your tiktok feed, you’d probably scroll right away if you saw the lighter because you already know what it’s all about and it holds less of a surprise to it. And that’s why getting to a winning product early can be so powerful, so that you capitalize on its wow factor, but we’ll talk about that later. So that’s an example of 2 similar products, one with no wow factor, and one with a great wow factor. But I have some more examples for you too so that you can develop an eye for products with a wow factor.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 3,
    "header": "This LED curtain product has a great wow factor. It’s a unique take on regular LED strips because these ones are controlled by an app on your phone and you can draw designs on them from that app. You can see how visually appealing these are and how it’s 10x more intriguing than regular LED’s. Even if you’re a person with LED’s in your room and you see them everyday, this product would still peak your interest because it’s unique and just a great product. But what’s an example of a product without a wow factor? Something like this capybara right here. Don’t get me wrong, it’s really cute and I’m sure they’ve sold a good amount of these guys judging by the views they’ve brought in, but the product itself won’t make someone say WOW or really hook their attention. It’s a stuffed animal plushie at the end of the day, and we’ve all had stuffed animals before. Now I could stop here since you’ve got a general idea of what a wow factor can look like, but that’s not what Mike and I are here to do. We’re here to unlock absolutely all of the knowledge that we can so that you can have the highest likelihood to succeed with dropshipping possible. So with me I have 5 more products that have a wow factor and 5 that do not. Let’s analyze them now so that you can get a feel for different types of wow factors and get you to the point where you can feel confident knowing if a product has that factor or not.",
    "content": "To lead off the 5 wow factor products, I have this phone case that shows any photo of your liking on the back of it. The reason why this product has a wow factor is because it’s something very unique. Most phone cases don’t have the ability to display different, customizable photos on the back of them. It’s very rare to find one that actually can update whenever you feel like it too. If this phone case were simply one that, when you ordered it, you could request a specific photo on it and it would be that one photo its whole lifetime, it would hold much less of a wow factor. It’s the customization of this product that really does the heavy lifting for its wow factor.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 4,
    "header": "The 3rd wow factor product I’ve collected is this scrub gun. It’s basically like a drill but with a scrub head connected to it. It’s gone viral multiple times because of how satisfying it looks with soap when you’re cleaning the dishes, and in this specific video the big wow factor is how the pan went from looking unsavable to perfectly clean. To have as extreme of a makeover there will definitely make people peak people’s interests. Even for me when I first saw this product I remember saying “wow” to it just because of how well it worked and how great of a job it did.",
    "content": "The fourth product is this egg flipper. Now I don’t actually think this product would sell too well for various reasons, the main one being that it’d be hard to make content consistently with it, but I will say there’s a good wow factor here. It’s a unique take on a regular spatula that makes you kind of laugh at it. And that’s the main principle of wow factors in my opinion, it’s that when you take something basic that people are used to seeing but put a unique twist on it it almost always results in a great wow factor.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 5,
    "header": "5. The plant is extremely visually appealing",
    "content": "Before going into the products with no wow factor I want to cover this one product that I found that’s kind of in a gray area as far as having a wow factor or not. And I feel like it’s important for a beginner to know that when you’re looking for products, there will be times where you can’t fully decide if one has a strong wow factor or not. But anyways this is the product I’m talking about, it’s some type of fruit cutter. This definitely piqued my interest, but it doesn’t have as strong of a wow factor as the other 5 products I gave you. I will say though that if it at least peaks your interest or stands out in your search for products, it’s probably able to check the “wow factor” box.\n\n        Now let’s get into the products that I found for you that don’t have a wow factor and don’t stand out when you come across them on your TikTok feed. The first one is this dog tool that has a leash, water, and bags for your furry friend. This product is more useful than anything, and doesn’t strike you strongly right off the bat. Also this is an important time to say that depending on the video you make your product may hold a different wow factor. Like if you were to show this product in a slower way, kind of going through its different features in a monotone voiceover, it’ll hold less of a wow factor compared to a skit. Maybe one where a person is walking their dog next to you, then when they poop they don’t have a bag but lucky you! You have a bag right on your leash. Then you can cut it to where they need to find some water for their dog, but you’re lucky again because you have it right on the leash. If you could package this in a video to where it seems like the benefits of this leash are just falling out of the sky and it seems like the best product in the world, it will grab a lot more attention than that monotone voiceover I mentioned. But the leash on its own won’t grab many people’s attention.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 6,
    "header": "Next I have this cup holder cooler. Again, I’m sure this product serves great use for a person who wants to keep their lemonade cool on a hot summer day, or a person who’d likely to keep their coffee hot when driving to work on a snowy winter morning, but there’s no huge “WOW'' there. So remember that: just because it’s useful doesn’t mean it has that “WOW” factor. It’s not unique enough for someone to feel the need to replay the video and say “wait I have to see that again!” It’s just a nice cooler/heater for your cup. Useful, but no big “wow”.",
    "content": "This is the flamefuser. A diffuser with orange leds that makes the steam coming out of it look like a fire. This product is a GREAT example of something that, before becoming extremely saturated, I would’ve said is an 11/10 wow factor. A funny thing about this product is that Mike was actually the first person to sell it, but it didn’t do amazing for him because the price point for the consumer was just so high and he couldn’t source it cheap enough. But anyways, this is honestly a difficult thing for me to teach because I only know that this product has no wow factor because I've watched it become extremely saturated, and that only comes through experience. That’s why it can be very well worth it for you to join me and Mike’s Discord group TRUST, where you can send us any product that you have a question about and we can let you know our full thoughts on it. It’s the perfect place for you to be if you’re serious about progressing in dropshipping and want to have unlimited access to me and Mike. But again, this product only has no wow factor because of its past and how saturated it has become. You’ll develop the skill to notice that only with time, obviously.\n\n        This product is some square led lamp that, maybe in 2019 would have held a wow factor but just like diffusers it’s been sold so much and is a lot less captivating now. I feel like this is a bit easier than the diffuser to tell that it’s lost its wow factor because the product itself just isn't that cool. And that’s really what you want to be thinking when you’re looking for products, “is this thing actually cool, will it really get people to feel captivated and feel the need to learn more about it, see more videos of it, send it to their friends…?” With this lamp, the answer is absolutely not. There’s nothing unique about it and so many more leds are 100x more interesting than this one. The colors aren’t even that strong on this lamp, it looks really faded.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 7,
    "header": "The next product that I’ve identified is this pulley that helps you pull down your plants to water them. It’s a great product to have for people who have plants on their ceilings and don’t want to have to use a stepladder to water them everytime. [TIKTOK SITE AMAZON ALI] On Amazon you can see that people are selling 2 packs of this product for $10 to $15. And I think you would be better off selling this product in 2 packs at the least, then have options to where people can buy in 4 or 5 packs. The price of the product is too low to just sell 1 of these. On Aliexpress we see that this product is able to be sourced for $3 to $5. Let’s say that we’re selling a 2 pack of these plant pulleys. Let’s say you find a supplier that gets 1 unit to you for $3, then your cost of goods for a 2 pack would be $6. If people are selling their 2 packs on Amazon for $10 to $15, you can likely price your 2 pack from $15 to $20. This gives you a profit of $9 to $12 per order, over 50% profit at both price points. The pricing is certainly fair to the consumer as well, especially the $15 price point for 2 of these. You could also have an option for a 4 pack of these. You’d be buying the 4 pulleys for $12 then selling them at $25 for example, profiting $13 per order. This could be the move with this product because to get 2 extra pulleys would only be $5 more. To profit $13 from a $25 sale is pretty standard too, so I like the profit on this product especially if you’re selling 2 packs for $19.99 and sourcing that for only $6. Easy $14 profit from a $20 sale. Also sorry if that was a lot of numbers being thrown at you, but that’s what we do with dropshipping. It’s all about finding the perfect balance of sourcing the product, selling it at the sweet spot, and squeezing out as much profit as possible.",
    "content": "The next product with good pricing I have for you is this dice kit that helps couples decide what they’re going to do for their date night. [TIKTOK SITE AMAZON ALI] On Amazon they’re being sold for an average of $11 and you can source them for an average of $5. It wouldn’t be worth it for us to sell this product for only $11 though which is why I’d start off pricing the product at $15 and hoping to see it convert the same at $19.99. $19.99 is a price point that I’ve seemed to notice is acceptable for a lot of products that would normally go for $10. In the consumer’s mind it can help to see that $19.99 instead of $20.00, and it makes them feel like they’re still in the $10 range. But anyways let’s say that we’re selling these for $15 just to start out, we’re profiting $10 per order if we can source the product at $5. $15 is fair to the consumer and only a few dollars more than the average price point on Amazon. So I like the pricing on this product but what if we wanted to be profiting a good amount more from the product we’re selling? Well that’s exactly why I want to cover this next product I have for you.\n\n        This is that foldable duffle bag that I’ve already talked about, and it’s a bit higher ticket. Higher ticket basically just means that it’s not a little $20 product, it can go for much higher and the profit that comes with an order is much greater. This means that the price point will be higher though and will result in a lesser volume of orders than a $20 product, but for a lot of higher ticket products, the fact that you’re profiting more per order can offset the fact that you’re bringing in less of a volume of orders. [TIKTOK SITE AMAZON ALI] If we take a look at this TikTok account selling it we can see that their pricing for it is $69.99. It’s a bit more expensive than what you’ll find on Amazon at $50 to $60 but when your pricing is higher like this, a difference of $10 is nowhere near as extreme as a $10 difference on a $20 or $30 product. If we go to AliExpress we can see that the bag can get sourced for $20, so if we were to 3x that and sell the bag for $59.99 then we’d be profiting $40 per order and be competing with Amazon pricing. Although this store is selling it for $70 I do think it’d be better to start off selling it at $60 since that’s already 3x margins which is really good. Of course we could always try slowly bumping up the price to see if we convert similarly but I think that $59.99 would be the sweet spot for it. This price point is very fair to the customer especially if you’re marketing the bag from its money-saving angle of how it brings a luggage amount of stuff at a carry on price. If you don’t know what I mean by that, I mean that this bag counts as a carry on, which is free to bring onto an airplane. However, because of the tech it uses to put your clothing in the lining of the bag and save you space, you’re able to bring an amount of stuff in that bag that, without the bag, you would otherwise have to spend $50 to $100 to check it before flying. \n\n        Okay so we’ve gone over some products that have good profit margins, are fairly priced for the customer, and sell high enough for you to make some decent profit per order. But what should you look out for and avoid? I’ll show you. The first product I’d like to cover is this levitating plant pot. [TIKTOK SITE AMAZON ALI] The product will be difficult to sell to customers at $80 per unit, which is what these people on TikTok are trying to do. I know that the product is pretty unique with its levitating feature, but it’d be difficult for people to not be turned away from the product after seeing that price point. Okay but what if we were to bring the sale price of this product down? A fair price for this would maybe be $49.99, but on AliExpress it doesn’t look like you can source it for much cheaper than $40, so at that point you’d only be profiting $10 from a $50 sale which just isn’t worth it. Also, if you were to just bite the bullet and sell this at $80 like the other store, you’re still $15 higher than Amazon average, so there’s really not much point for the customer to go with you over Amazon.\n\n        Next up I have this turbojet that apparently just blows very strong. These guys are actually undercutting Amazon which is a great sign and the product is more than a 2x profit margin which is pretty good. (You can source it from AliExpress for $30 and sell it for $70) The problem with this product though is its price point for the customer. Although I’m sure this product is high quality and has some good tech, the consumer’s unlikely to find this product worth the $70+ price tag. This is a great example of a product that profits well, competes with Amazon’s pricing, but unfortunately is just unfairly priced in the consumer’s eyes. If we wanted to check the box of being fairly priced to the consumer then we could sell one of these for $35, but at that point we’ve cut way too deep into the profit and would be profiting less than $5 per order. [TIKTOK SITE AMAZON ALI]\n\n        The last product that doesn’t pass the pricing/profit checkpoint is this air conditioner. [TIKTOK SITE AMAZON ALI] On AliExpress it seems that you can’t really source these any lower than $20 to $25 so in that case you’d want to be selling one of these for at least $40. I think that these guys selling it on their site are sacrificing their profit margins just to get some orders, and we’d rather spend time looking for a better product than just settling for small profits. On Amazon these things are going for about $30 and we could price it there but again, we’d just be cutting into the margins way too much. This is an example of a product that would be great to sell if we could find a supplier to source it for us for way cheaper, something like $15.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 8,
    "header": "Part 2 - Product Criteria, Content Ability",
    "content": "Let’s say you’ve just found an amazing product and you’ve ordered one unit from Amazon to come to your house, that way you can start making content on TikTok with it. Once you receive the product though, you realize that it doesn’t lend itself to content in any way. There aren’t any interesting videos you can make with it, it’s not controversial, and now when you post you can’t bring in any views and you run out of ideas for videos in a second. To help you not run into this problem, I’m about to cover how to tell if a product has good content ability.\n\n        When I talk about content ability, I mean the ability to consistently make interesting, exciting, viral videos with your product without having to repeat the same marketing angle over and over again. With some products, you’re unable to make a skit around them, make a prank video around them, and you really can only film it from one marketing angle. To help explain what I mean, I have this product for you. It’s a glowing planet orb that is really cool, and I’m sure someone would love to buy it, but if this one video style of you rolling it around and placing it on the light doesn’t go viral, where do you go from there? Maybe you could do something like gifting it to a parent, friend, or loved one, and film their reaction, but you can see what I’m saying now about how video ideas don’t naturally come to mind with this. What controversy can you slip into a story around this product that would make someone comment and help boost your video? There’s not much. Another product that lacks content ability like this one is the egg flipper that I was talking about before. Like I said before, it has a pretty cool wow factor, but what more are we gonna do with the product than flip eggs? Maybe do a series where people request us to flip different things, and we try what they request? But what could we really flip aside from eggs? Maybe burger patties… you know what I mean, what else would we do with it?\n\n        Okay Dom, so what product does possess content ability? Well I’m so glad you asked. To answer that question I’m going to show you the TikTok account for the height boosting insoles that Mike and I were selling and making tons of great, unique content with. I’m going to list out different video frameworks that we were able to consistently replicate and bring in great views with, then different video series that we were able to make, just with this insole.\n\n        Framework #1 with the Hytesoles were customer support videos. This worked great because we would just get filler clips of the insole like slipping it into shoes, showing the height difference with it in vs. out, holding them together, etc. Then the whole video would basically be riding on the storyline of basically the customer emailing us for some interesting reason. These videos really can be done with any product, but it was great with the Hytesoles because they naturally hold controversy. The next video framework was answering hate comments and also pouring gas on the fire of that hate by saying that “since girls can wear makeup men should be allowed to boost their height.” We wouldn’t have been able to do this without the product having natural controversy at all. You need that controversy there to get those comments in the first place to be able to reply to them and also add gas to that fire and make the video blow up even more. For example, there’s nothing controversial about the egg flipper. It’s not going to make someone feel a certain emotion when you say “this can flip anything.” They would just think something like ‘okay cool’ then scroll. With Hytesoles though like I said, we were able to say things like “men should be allowed to wear these” and “women, you’re insecure if you don’t let your man wear these” because it actually makes people feel something. They feel the need to defend themselves and say they’re not insecure, and they feel the need to say that these insoles are nothing like makeup, and “how could you hate on me as a woman for wearing makeup, you misogynist.” This proves that controversy like this in your product is very important. The final main video framework that we would pump out was the “confusing people at school/everyone’s confused” style of video. These would print views and again, it just came from the natural controversy of the product. Nobody would care if we brought that planet orb to school and said “playing with my planet orb at school part 1.” But by talking about how everyone looked at you differently or treated you differently when you wore these to school, it’s naturally a funny, unique experience. \n\n        So those were the main frameworks that we were able to make content on since the Hytesoles gave us controversy to work with, but what about the series styled content that would have 5+ videos as part of the series? Well our first one was “wearing these around friends to see if they notice I got taller” and again, this blew up just because it’s a naturally very funny video that people would like to see the reaction of. The second series is a spinoff of that one but it was “wearing these around my wife’s boyfriend until he leaves.” Right away this hooks people in because “wife’s boyfriend” does not sound right, but it’s also a perfect formula of wild hook, explain the product for a second, then there’s a funny skit to close out the end of the video that actually makes people laugh, send it to their friend, or want to rewatch it. Remember, the whole idea here is that we need a product which videos of it will be able to spark emotion in people. So those were the main videos and serieses that we made with the Hytesoles that now, you can understand, we wouldn’t have been able to make if we were selling the planet orb or the egg flipper. There would be no controversy there and we wouldn’t be able to make more content than just flipping eggs. \n\n        Let me give you 2 products that have good content ability and some content that you could make with them, and then a couple more that don’t lend themselves to content creation ability. The first product I have that lends itself to content is this customizable phone case. The reason why it’s so good for content is because you’re able to upload any photo to this case and also take the requests of other people in the comments, so you never really run out of content to make. You can also make prank videos with this for example where you gift someone this case and they don’t know it’s customizable, then you can get their reaction when their wallpaper has changed, but it was you all along. In doing that you show off the product and also emotionally connect with people. The next product that would never run out of content for you to make is this electric scrubber. The reason why is because you can always take requests from people as far as what they would like to see scrubbed. You could also take requests from them for what to put onto the pan, challenging you to see if you can get it scrubbed off. To round out the examples, I have the other 2 products that are not so good for making content. First is this willowglow light, and like most lights, there’s not much content you can make with this. Of course you can always make the “prototype vs. product” videos and the unboxing videos, but you want to be able to make actual serieses and funny, emotion sparking videos with your product. You can tell that these guys are limited to only a couple of frameworks with this product since that’s all they’ve been posting. Then finally is this Batman lamp. There’s not much you’ll be able to do with it, as it’s meant to sit in one spot on your wall and doesn’t have any function to it. Sure it’s cool and you can get your brother’s reaction if you gift it to him or something, but this product doesn’t carry any natural controversy where someone could see it and instantly feel the need to comment or feel some type of emotion. Even to someone who loves Batman, this is still just a plain old Batman light that won’t result in tons of content capabilities.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 9,
    "header": "Part 2 - Product Criteria, Audience Size",
    "content": "This is what you may end up thinking, as many beginners do. “If I want someone to buy a product, shouldn’t I find an extremely niche group of people who are extremely passionate about that specific interest since they’re more inclined to buy? Not necessarily. The reason why this is is because we’re doing TikTok marketing for these products. Because of this, we want a product that is very general and applies to almost everyone. The reason why is this: a product geared towards golfers who are fans of the Boston Celtics speaks to very little people compared to a cooking tool. First off, how many people are NBA fans? A good amount, sure, but now take roughly 1 30th of that audience, as there are 30 NBA teams. Now, how many people out of that 30th like to golf and are avid enough golfers to buy a Celtics golfing glove? See what I mean? Now how many people cook? Well, hundreds of millions of people, because everyone has to eat. Men and women both. Now if we were to be making content for a cooking product, we can apply to nearly everyone and that allows our videos to have a higher cap as to how much they can blow up. But let’s say there are only 2 million golfers who like the Boston Celtics, well sure when they see our video they may feel like it really speaks to them, but people outside of that specific audience are unlikely to interact with the content we make for that product. You really want to make sure your product applies to a HUGE audience, for example the Hytesoles I like to talk about apply to all men. Maybe even some women too, as they could buy it for a brother, father, cousin, or boyfriend. Even better though are phone cases that are gender neutral. Like that customizable phone case. It applies to literally everyone watching the video, since you need a phone to scroll on TikTok. Also since it’s customizable, you decide what photo you’d like to upload. So steer clear of products that don’t apply to hundreds of millions, if not billions of people.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 10,
    "header": "Part 2 - Product Criteria, Product Checklist Wiggle Room",
    "content": "I want to take a moment to say that the checklist I’ve just given you when it comes to finding products should not be the end all be all. I have sold BANGER products that don’t necessarily check all of these boxes, and maybe on a couple it just barely checks them. Especially when you start developing more experience and more of an understanding for products you’ll be able to use your best judgment and realize that not every box MUST be checked. I just wanted to make sure you know this, that way you’re not killing yourself trying to find some God sent product that goes above and beyond in checking all of these boxes.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 11,
    "header": "Part 3 - Product Research, TikTok & IG Burner Method",
    "content": "Give yourself a pat on the back for going through that whole part of Chapter 4, because it was a lot of information to cover. But like I said, it’s important that you know what you need to be looking for in a product. But what’s just as important as that? Actually knowing how to find these products. So in this part of Chapter 4 I’m going to go over different product research methods, the first one being the TikTok Burner Method. What this method is is basically making a brand new tiktok account and curating the entire for you page to be dropshipping products. That way you can scroll to your heart’s desire and just have videos of products as every video. I’m going to do some live scrolling with you to show you what I see, and I’ll let you know what I'm thinking with every product that we come across. We’ll do some brainstorming together as well. But first, let me get you set up with how to actually start doing this method yourself. All you have to do is create a brand new tiktok account, and if you’re in this course I’m sure you have the ability to do that. You don’t really have to brand the account in any specific way honestly, since you’re not going to be posting or anything and you’re just using this account to scroll on your feed. But what you’re first going to do is look up “dropshippers exposed” “tiktok made me buy it” “link in bio” “product vs. prototype”. From here we can click on any of these videos “exposing” dropshippers and go to the account of the person they’re exposing. We can see here that this account is clearly branded to sell their dropshipping product, so follow them and scroll through their videos. As you’re going through the videos you can like them, comment something random on them, and save them as well. What we’re doing here is telling the TikTok algorithm that we like these types of videos, and they’re going to start feeding us more videos like this because of that. Once we’ve gone through this account and 10+ of its videos, let's say, go back to where we looked up “dropshippers exposed” and go to another TikTok account that’s dropshipping. Start interacting with their videos the exact same way. Now do this for about 5 more dropshipping TikTok accounts and when you’re done with that you can exit out of the app and reopen it. You should be seeing some dropshipping videos on your feed now, so follow every account that you see that’s selling a product on it and interact with their account. It’ll get to the point where, by repeating this, your entire FYP just becomes products. For example this is my burner account and you can see that my entire feed is just products, and I follow 1.3 thousand dropshipping TikTok accounts. So go ahead, make your burner account and optimize the feed because it’ll probably be your new favorite way to find products.\n        And can you do this method with Instagram reels? Yes, you absolutely can and I’m about to make a brand new account and get the feed curated to products with you so that you can see how it’s done. (Transition into a recording and be like “okay i’m looking up X” now I’m following X account, etc. then just keep going until the reel feed is all set and you can say:) So that’s basically the exact same method as the tiktok burner, but for this example of finding products I'm going to be doing it with tiktok. But keep in mind that just about everything I do on my tiktok burner can basically be done on your reels burner.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 12,
    "header": "______________________________",
    "content": "But now I want to get into some live tiktok scrolling with you so you can see what products I’m finding and learn exactly what goes through my mind with this form of product research. Let’s get into it. [FROM HERE]:[b] Do live scrolling, giving thoughts on every single product that you find. Collect 3 products that you like then shift over to your computer where you can collect viral videos that you could replicate if you were to start selling them then brainstorm video ideas of your own. Also go to Amazon and see what they’re being sold for there as well as checking aliexpress pricing to see what the margin could be. Once you’ve done deep research for 3 of these products, determine the winner and make sure that the person going through the course completely understands why you would choose that one if you had to sell 1 of the 3.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 13,
    "header": "Part 3 - Product Research, AliExpress Hot Products[c]",
    "content": "Now that you’ve got a good feel for the TikTok burner method I want to show you another product research method which is going through the AliExpress hot products list. This is a product research method that I’ve never seen anyone do and you’re basically working backwards compared to the TikTok burner method. This method is great to see lots of products, but you have to be creative enough to be able to think of the content that you could create for them. So this isn’t the best method for beginners, but I’m going to do it live with you that way you can know how to do it when the time comes and you want to find products outside of the burner method. Also I would still take the burner method over this any day, it’s way better to find videos of the product directly on tiktok, this is just an alternative method. What you’re going to start by doing is looking up “aliexpress hot products” and clicking on this all caps “HOT PRODUCTS”. Next scroll down a bit and click on “Sale Home”. From here you can just get to scrolling, and if you’re visiting aliexpress on a brand new browsing profile (which I recommend) then you’ll get an unbiased platter of products served to you. They won’t be biased to what you’ve interacted with. So now I’m going to dive into this product research method and scroll through, letting you know what’s going on in my mind every step of the way. [FROM HERE basically just scroll down the product list and give pointers like “yeah i don’t usually consider selling clothing” and “i like to look for a product that’s just visually appealing off the rip because if it can be appealing in photo form just think about it in a video” and “i like products that actually serve a purpose and if they don’t and they’re just gimmicks, it better be a great gimmick for whatever reason.” Then just take some products that you like, check out what you could sell/source them for, take them over to tiktok and see if you can find angles of people running it and more. Basically it’s the same method as the tiktok burner method but it’s just the first step that’s different where you’re getting it from aliexpress. (I’m sure something will come to mind for you to say when the recording’s over and it’s just a straight up shot of you at your desk so just say that to transition it to the next product research method.",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 14,
    "header": "Part 3 - Product Research, YouTube Search",
    "content": "We’re now entering the product research methods that I honestly don’t do, but in spirit of making the most in depth, powerful dropshipping course, I’ve collected a couple that could definitely work. In testing them myself for a few hours I noticed that you can actually find some good products these ways, but I’d still go with the TikTok burner method all day. So the first of 2 product research methods I found that you could try is looking up product keywords on youtube. Basically the idea is that you go to youtube and type in “tech gifts” or “coolest amazon finds” and basically you’re doing the tiktok search method but on another platform. So I’ve got 4 search terms here for us to try, “tech gifts”, “amazon products you need”, “gift guide”, and “coolest amazon finds”. Now of course if you’re gonna be doing this method you should look up anything that you can possibly think of. Maybe “best fathers day presents” or “great gifts for outdoorsy people”, you can dive into any niche of product and also filter the videos by date that way you can go back 10 years or something if you’d like. Like I said this product research method is kind of the wild west, i’ve never seen it done but i think it has some potential. So let’s dive into it once again like the other product research methods and see what we can find. (from here you’re really just gonna have to look up these terms while being recorded and go through it and editing is what will take a while for this. But just act like you’re on a call with this one: you’re finding the products through youtube, brainstorming content with them and thinking about how you can make these products work and then you decide on a final one. After going through all of that you can script out a little summary that you want to say then you can move onto part 3, product research tiktok creative center)",
    "category": "Product Research",
    "source": "course"
  },
  {
    "id": 15,
    "header": "Part 3 - Product Research, TikTok Creative Center",
    "content": "The final product research method that I have for you is scrolling through the tiktok creative center, which is basically a place where you can see all of the ads being ran on tiktok. Like the youtube search method, i’ve really never used this method myself, but after trying it for some time to see if there was some potential i realized that there is, so i may as well let you know about it. The filters that i was using to find the most dropshipping ads were these right here: United States, E-commerce, Product sales and conversions, last 7 days, english, non spark ads, and top 21-40% in likes. Please do not take these filters as the end all be all, there could very easily be some that work way better, for example some less saturated markets are in europe, so you could make the country italy and the language italian for example. Or maybe some people are running ads in english but just targeting them in less saturated countries like switzerland, so try that out as well. I think it makes a lot of sense to filter for product sales and conversions though because that’s what a dropshipping person would be converting for, and to have the time of the ad ran be in the last 7 days i think is effective as well that way you’re not hopping on something from a month ago that may be oversaturated by this point. I also would dabble inbetween the best possible like rate setting and the second highest. Anything after that i feel like the ad just isn’t the best and there’s probably reason for that. If the ad were great and making lots of money he like rate would probably be higher. But again, like i said, experiment with different settings, including the spark ads vs. non spark ads filter. I’m not the most experience with this type of method for finding products but we’re about to dive into it and i’m going to see what i can find. (from this point you can just do the same thing. Hop in and try to find some good products and marketing angles with this method and just share everything you’re seeing. Don’t frame this as you’re trying to figure it out, go through it confidently like you know what you’re doing. It’ll be the same type of brainstorming if you like a product, checking the margins, thinking if you can make content for it, making sure the audience is big enough, then you can go with a product and have a solid plan that stemmed from this form of product research. That would be super valuable.)\n  \n\nPart 4 - Outro\n        Congratulations, you’ve made it through the first big chapter in this course, and I hope you feel very confident in identifying winning products and finding them as well. Moving forward from here Mike’s going to take you into the Suppliers and backend part of the course which is extremely important, and if the backend of dropshipping seems confusing to you now, it surely won’t after he’s done going through that chapter. If you have any specific questions you can dm me on instagram @dedolid and I’ll do my best to get back to you, just let me know you’re in the course and ask whatever you’re confused on. But i’ll see you in Chapter 7, where we’ll go over mindset.",
    "category": "Product Research",
    "source": "course"
  }
]