[
  {
    "id": 1,
    "header": "﻿INTRO TO WEBSITE",
    "content": "Now that your shopify store is set up by AI, ready to be customized, and you chose or found a product… It's now time to turn this product into an actual business with a professional functioning website built around it. This chapter will be split into 2 main parts, a website overview and the live website customization. In the overview I will be going through what makes a good website, comparing good and bad sites, and explaining why the website is so important in relation to you making the most money. And in the live customization I'll be going through everything from logos to colors to product descriptions step by step. So by the end of this chapter you will be ready to start selling your product and making money.",
    "category": "Final Website Build",
    "source": "course"
  },
  {
    "id": 2,
    "header": "﻿INTRO TO WEBSITE",
    "content": "OVERVIEW HERE",
    "category": "Final Website Build",
    "source": "course"
  },
  {
    "id": 3,
    "header": "WEBSITE BUILD",
    "content": "First things first we need to make and come up with a name for our product and our store. At this point you guys are probably sick of me saying branded or the branded feel of your store but your name actually ties into this massively. Without a name you have no brand and without a brand you can't have a one product branded website like the good examples we went through in the overview. So for reference in this entire website tutorial I am going to be creating it based around this product right here. Which if some of you know me before watching this course you've probably seen the multiple youtube videos i've posted actually dropshipping it myself and finding success. But since I want to do this all from scratch with you I'll be picking a brand new name, making new logos, new everything. So when it comes to naming you wouldn't just name this the folding duffle bag. It would be something like the examples I've seen others do such as mycarryall, luggo folding duffle bag, travel flex bag, ect… And the best place to get a name like this is another ai tool I found and have been using for awhile called namelix. What you do is add keywords so I put “luxury folding duffle bag”, selected brandable names, medium randomness, and it then gives a ton of options to choose from. Personally I look for the one word names so that i can have the product title be something like ___ folding duffle bag. (Scroll through and pick a name) \n\nBecause we have a name picked out we can go ahead and close the namelix tab and come back to the shopify tab. If you closed the shopify tab from earlier just search up shopify login and sign back in with the email you used when we created it with AI in the first chapter. But if you have been following every step up to this point you should find yourself back on the home page here. And now that we have a name picked out, what you want to do is head to the bottom left corner of your screen and click settings. This will bring us to the general tab and right here under store details what you want to do is click this little pencil icon here. And under store name type in the new name you have. So for me I will put “trevelo folding bags” and click save. \n\nNow that your store is named, what you're gonna do is click X here in the top right, and click on the products tab. As you'll see there are the 10 preloaded products in here but since we will be making a one product store just go ahead and select all these and delete. Once I refresh they should be all gone and yup they are. This is perfect as we now have a blank store to where we can add in our product of choice, add photos, and write the product description. Go ahead and click the “add product” button on the top right of your screen which will bring you here which is where we will be bringing this product to life. So let's start from the start and give it a name. To give off the branded feel I have talked so much about, we want to include the name we just came up with in our title. So for me this will be “The Trevelo Folding Duffle Bag” You can also do variants of this such as Original Trevelo Folding Duffle Bag just Trevelo Folding Duffle Bag but you really just want it to flow nicely. One of the biggest competitors is my carry all and when i go on their website you can see the name is just their brands name. Which can work in some instances as I technically could just write “the trevelo” This is all personal preference but you don't have to stress about this at all as long as again it flows nicely and sounds professional. \n\nBut when it comes to really customizing, media is the very first step… The reason that photos are so important is because that's the first thing customers see when landing on your website. And what we are looking for are clean photos with mostly all white backgrounds. If your product needs to be demonstrated with a different background it makes sense but at least for the cover you want a clean white background that just shows off the product and gets straight to the point. The photos are one thing a lot of beginner dropshippers mess up on because 1 it's not exciting and 2 doesn't seem like that big of a deal. But you just have to put yourself in the shoes of a customer and think about how you would feel if the photos were blurry or showing too much. All the red flags would be going off saying it's a scam. So the first place we can look is just a simple google search. On top of that amazon listings can have some good photos. And a big one is finding photos on your competitors website as long as it's not branded to their name. So before filming I saved some photos myself so we all can save time. They all have white backgrounds and simply show off the bag and all its different variants along with 2 of them showing off all the features. All of them are also the same shape, this small square which I did by just opening up the website canva, signing up, create design, logo, and adding and adjusting the photo here. (demonstrate this)\n\nClick add media, add all photos\n\nMost popular color or variant should be the cover photo (For me it's brown and then reorganise) \n\nSo now the photos are all done and lets get this description figured out\n\nSo there's a certain style I like to use for the description that really practices what I said earlier about showing and not telling. \n\nMap out description (Bold text, short description, insert gif) (repeated 3-4 times)\n\nWhat do all these things mean? Well I'm about to show you. \n* Check competitors websites (mycarryall)\n* Chat gpt\n\nThis is the type of description you see a lot of beginners use with just a text of text that most potential customers aren't even gonna read. But what I like to do is use this to get some ideas for my own and rephrase it into something much more concise and compelling. But like I said I already had a few ideas in mind and I think the biggest reason someone buys this is to save money not having to check a bag. So I'm gonna cook up this first bold claim and short description then come back to show you what I put and why. (No brainer/only cost $60) Write the other and quickly share them. Say I will come back to the gifs in a second but let's move down to pricing. \n\nThe number you price your product at really depends on how much you can get it for from your supplier. And if you remember our supplier is autods, the website we signed up for earlier. After this website chapter I will be showing you all the ins and outs of autods. How to work the platform, get quotes for products, see orders, send orders, everything. But in this stage we just want to get an idea or estimate of how much the product will cost by looking online. The main website you want to go to is called aliexpress. Aliexpress is basically an online marketplace like amazon but the products you see on there are mainly from china with low prices as they are typically coming directly from the manufacturers who make them. And those low prices are usually right around the same range autods will quote us for. So on aliexpress I will simply search folding duffle bag and tons of options will come up. Some will be random but others will match your actual product like this one here for $20, $20, $30, $20 so I expect to be able to source this for around $20-30. The 2 other things we should check before settling on a price are amazon and our competitors to see what others are selling ir for. So I'll do the same and search it on amazon and yeah this one here is the biggest brand selling it or $50. And mycarryall has it for $60. So what you want to aim for is around a 2-3X margin. Meaning if I can buy it for around $25 I want to sell it for around $50-75. To be safe I'm gonna go ahead and price this at $60 and then down the line once I actually know what autods can source it for I can lower or raise this. Every product has different margins and different prices but as long as you stick to that 2-3X and have it around the same range others are selling it for, you will be golden. And for the compare at price you want this to match whatever “sale” you are running. Some people like to make this very high but to me that just becomes unbelievable for the customer and I like to set it around $10-20 higher than my products cost. So for this i'll just put 79.99. Keep this checked, we don't have to fill this out, and you want to uncheck this track quantity box. Shipping we don't have to figure out as autods will do that for us but variants we do have to configure. Coming back up to the photos you will see I have 5 different color options meaning I have to make 5 different variants. Your product could have none, it might have even more, maybe shoe sizes, clothing sizes, but it's all added in the same if you have any. \n\nAdd variants \n\nMatch variants to the colors\n\nAnd one thing to keep in mind with this order of colors is that the top variant is going to be what customers see first. Like I said when we added in the photos I wanted the brown to be the cover image so that's why I added it as the first variant. \n\nSo everything is about done on the product page and all we have to do is add in the gifs. So I'm gonna cut to a future recording of myself showing how to film, edit, and setup the gifs on this page. (Snap)\n\nExplain what the gifs do. \n\nSo the product page is done and to me I believe this is the hardest part when customizing your website. Because there's alot more design and thinking you have to do for the photos and description but now we just have to change some last settings, make a logo, adjust colors, and we will be ready to go. \n\nGo through all the basic settings (explain some why the AI tool helped so much)\n\nWe got the pages, payments, and our product setup so we're ready to start actually designing the look of our website that customers will see. But first before that we do want to design a logo. \n\nSo when it comes to creating the logo, what I always use is Canva, the same platform I mentioned earlier for your photos. So what you're going to do is just click create a design in the top right, click on logo, and it'll pull up this blank square here, which we're just going to build off. Over here on the left, you can see a bunch of templates they give for logos, which honestly do work sometimes, but I kind of have an idea of what I want to do for this logo and none of these really follow it, but definitely feel free to use these if you think it's going to fit your brand. And for a lot of my logos, I use their premium features such as the elements, which give you a ton of options if you do have premium. But for this example, what I have in my head is only using text and we can do that all for free. So I'm just going to come down to text, add a heading, and what I'm just going to type out is our name. And the first thing we're going to do here is. Find a font for it. This Shirkhand is one I have used before and I think I'm gonna go with it again But we might as well go through the rest and see if there's any better options. You kind of want to match the feel of your website or the product you're selling with the font you're giving like if it was A fun dog product you'd probably use Chewy right here, which kind of fits that theme Yes, we are going for the modern luxury duffel bag feel, but I think shirk hand still does that well, even though it's not some cursive or minimalistic font. \n\nAnd now what you're gonna do is pick a color you want for your logo and your website. Me, since I'm selling bags with the main bag being brown, I'm gonna go with some sort of shade of brown. I already have this pulled up right here. As you can see, if you just come on to htmlcolorcodes.com and you type in your color, It'll give you a ton of options and right before I started filming this I picked out this hex code right here So what you're going to do is copy it Come back over and you can see they have the hex codes on this website as well So whatever you pick you can just copy that but we're going to come back over. Come to text color and we can just paste this in right here.And there's the color I was wanting. It's kind of a tan and brown mixture. So what we're going to do is make this the whole size of the screen. And then I don't want it to just be Travelo. I want to add another text under it in black, which will just say folding bags. So let's get this same font and then let's change this to black.\n\nNow we can position this in a way. That people can still read it, but it's not taingn away from our brand's name. Honestly a very simple logo, but I think it's still effective for the feel of our website We're trying to go for but I might as well play around with some other design stuff We could do this and see if I like it even better So elements is where you can get a bunch of stuff So I looked this up before plane taking off because traveling and this is what I was talking about with premium A lot of these are locked but one like this could work and it could almost be something like like cropping this So we just have the plane And then maybe acting as if the T is a runway and it's taken off….\n\nSee, I don't think this is bad, but I honestly just like it better without it. Just nice and simple and straight to the point with our name. So for you guys, you should also test around, use all the elements such as we could even put in duffel bag. I'm sure there'd be options we could use. You could almost have the handles coming out of here.\n\nBut again, I think it looks just fine with text and you really don't have to overthink the logo as long as it doesn't Look unprofessional and make people feel unsafe on your website. So since there's so much white space left on this logo, and it's not like one circle logo instead of just sharing this and downloading it Normally, i'm just going to take a screenshot of it to minimize all the white space so that you can really see it on Our website which you guys will see in a second.\n\nSo i just got a screenshot this And that's it for the logo. \n\nSo let's come back to shopify because it's finally time to make this website come to life. You want to go ahead and click the online store tab here on the left side of your screen which will bring you to the online store editor. You will see the build your store theme the ai made which is currently live and likely the dawn theme here which shopify automatically installed. But we actually have created a custom theme for you which not only makes this process faster but this theme has been proven to convert website visitors into buyers very well. It's what we both personally use on all our dropshipping stores. If you look in the description under this video, you will see text saying “zip file download”. Simply click on this blue link right here which will open up a google drive folder. And for this to work best I heavily recommend you are using a google browser. But once you are on this page, click this little arrow pointing down, and click download. As you see it says zipping 1 file, file zipped, which will now put it in your downloads up here or on your computer. Now come back to shopify, click import theme, upload zip file, and drag it from the top right or click to select it on your computer. Once it's in click upload file and it will start installing this theme. This may take a few minutes but just stay patient. Also if you have a technical error or really can't figure out a certain step in this process. We created this email for support where we will try to get back to everyone and help with any problems potentially holding you back as soon as we can. Once it has finished uploading click publish, publish, then customize. In this tutorial I will just be using the free tools so it is accessible to anyone but if you want even more features down the line you can sign up and pick a plan through debutify. But I will just X this out and switch to the mobile view here in the top right. \n\nSo as you can see, this is just a raw skeleton of what our website is going to look like, and we just have to plug in all of our information here. As you can see, we literally just gave you the guides on what to plug and play right here. So starting off, click on featured product right here. Select product, and we're just going to click our product that we already made together. \n\nClick save. And now I think the best move for us is to start implementing our colors. So typically with a dropshipping store, you want to have three colors. So for me, it'd be the brown, black, and white. And for you, this could be a whole different variation of colors. But on average, you see most people do one main color and then black and white.\n\nSo what I'm going to do, because I actually forgot the hex code that we used on the logo. I'm going to come back into Canva and get whatever this color is called. So we're just going to copy this and now we can come back into Shopify. And paste it in here. So as you can see, this changes to brown now. And we're just gonna go down the line and change all the colors in which we want.\n\nBorders I'll make black, which is such a small detail, you can just see it right here. Most people won't even see that. Then for the text, I'm going to black this out. Borders, we're gonna go with our brown. And basically the way we have it set up is all these blue colors, you can just change to whatever color you picked.\n\nSettings, black. buttons, brown sales price, brown, and coming down. You can already see it starting to look better as this just really matches the color of the bag. So now the drawer section right here is when you pull this out. So we definitely want to change this. And this one may take a little tweaking.\n\nAs you can see, we have a dark blue and a light blue. So we just got to figure out what we want to do here. Probably make this the background and then do somewhat of a darker Brown. For the accents. I'm trying to change this to the brown. Um, sometimes these can get confusing. Buttons, buttons, label, links, and accents.\n\nWe just gotta keep changing the colors and you'll eventually find what fits. Let's try this dark brown here. Nope. Oh, it's, I know, it's form elements. I've done this so many times. So now, as you can see, when you hover over it, it's not gonna be that blue anymore. And this looks pretty nice. Dark brown to compliment that.\n\nActually, what I'm gonna do, Change this to black because that's the whole theme we're going with on the website. And the last thing for the drawers part of the colors, we want to check the cart page. So, Let's add one of these to cart. It's going to try to take us to checkout, but let's go back to the cart.\n\nAnd as you can see, the colors look pretty good right here. And this is one thing that looks so good to customers with this theme, as it'll say your subtotal, which is your normal price, and then show them the savings that they're going to get. All orders processed in USD. Yeah, this looks good. So let's head back to the homepage and we got to do our footer menu right here.\n\nBackground. Brown. These borders looks like we want to make these black. Yep. And then for a lot of stores, you can have buttons on your footer. But as you can see, we just had to change those two things and it's all matching already. So there's not much more we have to do. But if you do add some sort of button, you just change the colors right here as well.\n\nSo as we scroll up, you can see all of the colors match. And of course we can still tweak these as we go, but we're just gonna click save right here. And there's one, uh, Very important part we need to do, and that's on the checkout page. Which is almost kind of hidden, and what a lot of beginners forget to edit.\n\nUh, let's just refresh this. Checkout. So we gotta scroll all the way down to checkout. Then now you can see the colors are here as well. Again, so many people miss this step.\n\nBang. Colors are changed. So now you can see we got the brown here. Oh, we gotta change this text. I don't think it's updated. Uh, we probably have to click save and then it'll update. Yep. Alright, so just change this to brown. Save. I'll change all the text and like the outline right here to our brown along with these links right here Which were blue before which if something is ever not updating just click save and it'll refresh and lastly on the checkout page Which is another big thing people forget is you need to be having your logo here select image add images Since we took a screenshot, it'll be on my desktop So we can just load this in done and now that doesn't look good.\n\nI usually go a small and left Save. Let's be sure this looks good. Yup, so now we got the logo here. They can see this here and all the colors are up to date. Looking good. So we're done with checkout. Now let's come back to the homepage. And while we're doing it, we might as well get our logo on here as well.\n\nSo you're gonna come to header. You're gonna click mobile. Add the logo here and we might as well do it for default as well The thing is almost everyone who comes on our website is going to be on a mobile device Because we're going to be doing our advertising through tiktok instagram youtube, which are all mostly on your phone So that's why when i'm building this i'm in the mobile view instead of the desktop view Which I don't really worry about at all So now we got our logo right here, which does look pretty good and what we're gonna do Before we add these photos here.\n\nWe're gonna go full details And this will bring us to our product page, which is really what matters the most. We're gonna be sending all traffic to this product page so they don't get distracted by everything going on in the homepage. This will actually increase the chances of them buying because it reduces one step in the process.\n\nWhere if we sent them to the homepage, they would have to find that full details button, click it, and then end up here. And again, I'll show you at the end of this how we redirect people that click on our link from the homepage to directly to the product page. So as we scroll through, you can see, it's not like we have to send them, more with this pre built file.\n\nBasically, everything is already built and set in place for us. As you can see, we already did our product description too, which comes out very nicely on this. Few things we have to do like add reviews and testimonials, but for now, let's click save here. Just to be sure. Because there's been times for me when I've built whole stores without clicking save and then my computer dies and I lose all of the progress.\n\nSo be sure to continue clicking save as you go on. So this testimonials page is really optional and I'm about to show you why, but first we want to get in actual reviews. So for now, since I'm not covering it, what I'm going to do is click this eye right here, which won't delete it from the store, but it'll just have it disappear.\n\nSo let's click save. And how we get these reviews is through a platform called Loox. Once you click the link below, you'll land on a page like this. So we can just click get started for free. It'll bring us directly to the Shopify App Store, which is already connected to our store. And then we just have to install this.\n\nInstall. And we're going to say no to this. We're going to start our seven day trial of the beginner, because that's really all you need, unless you're at a massive scale and you want those full customization, video reviews, and more. So start seven day free trial. Take beginner. Approve. Again, there'll be seven days until it actually charges you.\n\nBut in a second, I'll be explaining why these reviews are so important. What's nice is Luke's gives us a nice little setup here. Again, just going to paste our brand color here. And I like to go with this one. This does not really matter. So I just set it to the max 10 percent enable core script. So we're just going to click this.\n\nNow click save as it already checks it and sets it up for us. Now close. It'll verify we're good. Now add the product reviews widget, which is the most important part again already does it so Click save and you can see right here It's showing us sample reviews, but this is how they're going to look and again If you don't want this to keep popping up, you can just pick a plan through debut defy early on.\n\nSo now We can close this out head back over to luke's continue and for the rating widget. We can just skip this So we're going to click import now and it will now have this import to luke's button Which we're just going to drag up into our bookmarks bar done And now what we're going to search up is AliExpress, the website I talked about earlier when figuring out pricing. \nSo what we're just going to look up is folding duffel bag. And let's see if we can find any reviews for this. Let's sort by orders. And this one's going to be a good option because it has how many reviews? 26 reviews. Okay, not bad. But once you open the product, click import to Luke's, you want it to go to this product.\n\nOkay. I like to do four stars and up. Um, let's try it only with photos because really what you want are reviews with photos, preview and import really great bag. This is good.\n\nIt's good. See, we're not selling this model though. Um,\n\nall right, we only got two from that one. So now we just have to move on. Keep looking. Let's look at this one. Five reviews, probably won't be any good ones with photos, but it's still worth a shot.\n\nNot what we're looking for. One of the issues here is this is such a new product that hasn't blown up yet on AliExpress, so there's not that many reviews of it. So I'm just going to try my best to find as many as we can, but that's where we're probably going to have to utilize the testimonials tool.\n\nKeep scrolling, just trying to open up all these. And now what we can do Four stars and up. We don't have to do the photos cause we're really just trying to get as many as we can right here. So it's, uh, we're going to import this little fragile note. We don't want that, uh, finish importing. All right, next one.\n\nImport to Luke's.\n\nAll right. This is a good review of the 10 very good. I work. It's good. No, no,\n\nI don't know\n\ngonna work And now once there shows no text on these right here, there's gonna be no more. So just end that and you just keep repeating this process until you find around 20 reviews that actually work that say good things Show good photos about your product. All right for myself I was only able to find around eight reviews But this makes for a perfect example of what you should do if you don't find that many reviews And as always, the more reviews the better, as this really increases the social proof.\n\nLiterally anyone, even myself, when I'm looking to buy something online, I always look at the reviews. This is because it tells you what other people are saying, and if it's actually a legit product. That's why on Amazon, the only products that really sell well are the ones with over a four star review. So one, we only want to be importing the ones over four stars.\n\nAnd two, we want to get as many as we can to make customers feel safe. Like I said, I was only able to get eight, but let's head back over to the online store. Click Customize, Mobile View, Full Details, because this is where they will be shown. And as you can see, all of the seven reviews show up right here, which is pretty bad, but at least it's something.\n\nAnd this is where we're going to utilize the Testimonials tool. If you were able to find and import over 20 reviews, you don't necessarily have to do this, but it's still not a bad idea. So, I'm going to rename this to Here, what\n\nOur customers are saying save and now we can edit all of these things right here and to be ethical I like to actually use real Amazon reviews. So here's a very similar bag So we're gonna come into the ratings and just copy and paste what people are saying. Alright, this is perfect so we're just gonna paste this in here and We might as well just copy this as well.\n\nThank you, Gene. Save. And now we can move on and repeat the process for the rest of them. We just want to look for the one saying good things about the product. And that maybe explains some sort of feature. Alright, this is good. Paste. What was your name? Kat. Go ahead and close these tabs. Because we don't need them anymore.\n\nAnd now Shopify lets you have around eight of these, I think, but I'm just going to do five right here since we already have our other reviews set up here. And most people aren't going to read through all eight of these long reviews, but it's still a good look to have.\n\nI would try to do the biggest one first like this. And then you can also choose by moving this around right here. You can move it over the testimonials and it'll put the reviews over the testimonials. But for me, I like how it says here what our customers are saying and then they can see this after and we're really almost finished here Just a few last touches.\n\nSo for the announcement. Oh, yeah, you want to make this not the best in math So i'm gonna look up what? percent Of 85 is 65. So whatever sale you're promoting is what you're gonna have on your announcement So announcement message We're just gonna name this 25 percent off this free shipping today only.\n\nWhat this does is increase urgency, which is something we'll be talking about when we go over advertising. Head back over, as you can see this has changed. Scrolling down, everything's looking good. And for the footer, yeah, product name here, Trevello.\n\nYou can put a description here if you want, but for this product it's pretty self explanatory, and it's not like some supplement where you'd want to put some disclaimer. So we can just delete that, still looks good. Click save. As we scroll up, just about everything is set up. And the reason we did all those pages in the navigation, like the privacy policy and terms of service, is because now, when we're setting this up, they're already on our website, so we don't have to go back and do that.\n\nAnd if you pull out this menu right here, you can see, track your order. the duffel bag, and then all of them here with our email. And this is another reason why you wouldn't want to use your personal email, because having a branded email also looks good for customers. Instead of it saying moe mike at gmail.\n\ncom. Cart. Oh, this. See, something we changed when we were editing everything else. Change these colors right here on the cart. So we want to be sure to change this. Oh yeah, it was down here. Let's make this white.\n\nUh, accent background, probably white. Or no. See, this is black so they can't even type. Alright, what if this was a grey? What if it was this that looked off? Yeah. Now this button got all messed up as well. Uh, let's make this black. If I make the button label the brown, it still looks a little bit off. The form element.\n\nOkay, that looks good, because the text will be in white. So again, once you do your final walkthroughs, you do want to go through every page again to make sure you didn't switch some random setting when you were setting up something else. Like this part, we're all good. And now, the homepage really isn't too big of a deal, because like I said, all the traffic isn't going to be going to your product page.\n\nBut, we do want to edit this. So I'm just going to head back over there in case people do end up going to our homepage. You want it to still look good. This stays the same and we just have two slots where we're going to put some images with text, select image. And honestly my favorite thing to do here is add the gifts at least for the first one.\n\nDuplicate this, head back over. Products and we're just gonna copy things from our description easy money after one use And then copy what I said under that paste it here save So now if someone comes to our home page They're still going to be able to see the bag in use and then they can go back and click full details To go back to the product page and buy it or just click add cart if they're already convinced now for the second one I think it could be good to show one that shows all the benefits like this doesn't look bad Although hex looks a little off.\n\nSo what I would do is put another gif here This next gif with all the text above it, but I don't have them loaded into the store right now. So what I'm going to do is just click this and it honestly doesn't even look bad with just one, but you can add two, one, even three. If you want just going to run through everything quickly to be sure everything is set up.\n\nAs you can see, they can click their variant here. So if they click the Brown or the black with wheels, it then shows the black with wheels, pink, \n\nNow. Let's head to this page But we want this to be brown Because this is what they're gonna be landing on. Looking good over here. Cart is looking good. Description looks clean. We got our reviews. Tempted to put these above, but I think for now, I'll just keep it the same. Cause again, it's up to you guys, what you want to do.\n\nLet's go ahead and head to checkout. Everything's looking smooth here. So I'm just going to pause this recording, be sure I have everything set up. And then there's a few things I want to lastly go over with you. \n\nSo everything looks perfect on the website. And for you guys too, if you do want to make sure everything's working fine, you can just go through the full process.\n\nA customer would go to your product page, add to cart. Go to checkout, check out, and actually place the order to be sure it goes through. This will give you that confidence and trust that when someone does actually come on your website, they will be able to purchase and they will like what they see. \nAnd before I fully close out this chapter, I'm gonna cut to a past recording of myself where I run through every little piece of information about shopify, some tools I didn't go over today, and a past store of mine to ensure you are equipped for the long run. \n\nOutro\n\nGetting to this point right here with a winning product clean website and all the back end setup is definitely a win in itself.\n\nAnd statistically, even less than 10 percent of people who want to try dropshipping even get here. So you should be proud of yourself for that. But to actually start making money from dropshipping, it comes from our advertising. You can't make money from this website if you aren't getting people on this website.\n\nAnd to me, this is the best part. Although with that being said, there is a ton that goes into Successfully advertising a product. and I confidently know that this course already has been packed with value But the advertising is where Dom and I really take pride in what we teach throughout all of our advertising accounts over the past few years We have done well over a hundred million views and probably getting close to a billion views with most being product focused and dropshipping Videos that make us money. and even though we're about to teach everything we know about organic and paid Advertising if you do want to have long term success with dropshipping your mindset needs to be in the right place So before the big advertising section, Dom will be taking you through a mindset course covering ideas that, if followed correctly, basically guarantee your success in the long run and make you unstoppable.",
    "category": "Final Website Build",
    "source": "course"
  }
]