[
  {
    "id": 1,
    "header": "Paid ads overview",
    "content": "It's now time to cover a pretty exciting part of dropshipping which is running paid advertisements. I touched on this briefly at the start of the organic section about how instead of your video getting pushed naturally from the algorithm, you are paying these platforms a certain amount to show to and insert that video into a certain number of people's feeds. Which I'm sure you have seen before when something comes up while you are scrolling as a sponsored post. The idea is to take whatever your profit is and be spending less than that on ads per order. So if you profit $15 and spend $7 to get an order that leaves you now with $8 in profit. Which yes causes for a much smaller profit margin compared to if you got that order through organic although you can scale so high with ads because there is an infinite amount of money you could spend. Which I do have proof of through my own experience running ads on this store right here but for the time being I am not able to share the name. And if we just come over to the analytics and select November 6th to January 6th, 2 months, you can see a whopping $373k in sales. But if we zoom in into only november I think this is the craziest part about it and what really demonstrates the power of paid advertising. Keep in mind I did already know this product was a winner because a few months prior I was doing some organic videos for it. But the very first day running ads we did a light little $265 in sales which was very profitable for our first test. Then the next day I put some more money behind it and did $739 in sales. Again very profitable so I put even more money behind it, leading me to do over $5,000 in sales which is where I knew something was special about this one. And from the work i was doing nothing really changed going from 200 - 5000 in a few days it was just playing the same game at a higher level with more money involved. The next 10 days it went up and stayed around that level consistently because unlike how organic is most the time where a video will go viral, you will have a massive spike, and it will die down. Paid ads stay more consistent because you control how much money you are spending and really how many people are seeing the video. It then took a bit of a dip because I was preparing for this day right here where I did $26,000 in sales. Why? Because it was black friday and if you know anything about black friday it is a dropshippers dream. This is because people go out of their way to buy things on this day so when you offer them some “crazy” black friday deal odds are they are going to take it. Especially when a lot of people have seen your product or ads before who maybe didn't want to buy then but now it's an opportunity they can't pass up. I was told by some mentors leading into it to make myself uncomfortable about the amount I had set up to start spending. If before black friday I am running 5 campaigns total they told me to run 10-15 for this day. So I did and well we can see that it worked. From there the sales stayed very high because i stretched it to black friday weekend, to cyber money, to cyber week and so on. Then December 1st through January 6th it continued to be wild with multiple more 20k days because this was a self improvement product and if you see when this spike was it was right before the new years. Because I created an advertising angle around new years goals and making 2023 your year with the product. So what I learned from this experience is that paid ads can be crazy with insane amounts of scale but it does put on more stress than organic. To have these massive days I am spending legit thousands of dollars a day on ads which to a point can almost mess with your head. But what is nice is that you can control the amount you spend per day meaning if you woke up to unprofitable ads you could just turn them off and cut your losses. You are in control which if you wanted to you could spend .50 and turn the campaigns off. Now in this paid ads section we are only going to be covering tiktok rather than organic where we put these videos on all of the platforms. Reason behind that being it is what we have the most knowledge on and for that store I just gave an example of, that was done strictly all through tiktok ads. Right now I believe that tiktoks ad platform is the strongest but what is nice is that the lessons and overall structure of the ads and how to set them up can be brought to all the other platforms the same way. For example the way you film and setup a tiktok ad campaign is almost identical to other platforms such as facebook and snapchat. But again tiktok is the strongest right now because that is where all the attention is online and it offers the lowest costs to get it in front of people and get orders. There are people who like to diversify and run ads on every platform but for me, my goal was to just master one and learn the ins and outs of tiktok to have the biggest advantage there. Which is a route I would recommend for most people getting started because it keeps it simple and lets you become a “master” at that one skill.",
    "category": "TikTok Ads",
    "source": "course"
  },
  {
    "id": 2,
    "header": "The layout and overview of paid course",
    "content": "To give you an idea of what this section will be all about first we will be covering the differences of a paid ad VS an organic video. On top of that, like done for organic, we will be showing what makes a good paid ad. The general structure and layout of a paid ad. We will be talking about if having the product on hand and filming it yourself like organic is needed with the pros and cons of the two. We will be making, filming, and editing the ads live with and without the product on hand. Revealing our strategies to test products in the early stages. Show how to analyze the metrics of the ads so you can know what to do and look out for when they start spending. And of course revealing our scaling strategies which is exactly what i used to reach those crazy numbers on the store i just showed you.",
    "category": "TikTok Ads",
    "source": "course"
  },
  {
    "id": 3,
    "header": "Fundamentals of a paid ad VS organic video",
    "content": "When we talked about organic and I shared with you the video examples I'm sure you could see how the tone you talk in is very lighthearted, fun, and feel like you are just a creator making a video about the product. But the first step in understanding a paid ad is that you want to put on a more serious and professional tone. Not to the point where you are acting like it's a TV commercial but you can leave out most of the fluff with the goal of just getting straight to the point of why they need your product. And this is because you don't need that fluff or crazy controversy to get views and get people to see it, because you are paying for people to see it yourself. Which this is something we will go over but I want to note that if it is a good ad you will get lower cpms (the cost to get 1,000 views) and be able to get more people to see it for less. And when I say fluff, what I mean by that is crazy comment bait, jokes, or things like saying share with a friend who needs this. Because engagement on the post is never the goal and really our only goal is to get orders directly from the video. Almost every time I run ads I have the comments turned off so it wouldn't even make sense to do those things. Most ads wouldn't perform well as a normal tik tok post because you are making an ad and not content crafted to get views and go viral. And trust me if anything is confusing here it will make a lot more sense when we create them live with you and share some examples. And the last part I want to share for the fundamentals is how important having the product as the main focus of the video is. CPC is the cost to get a click, one of the most important metrics, so you want the people who do click to be clicking for the right reasons. Your product. There was an example I saw shared once of someone selling bikinis and swimwear. Everytime they would use an attractive girl in their ad they would have way better metrics and more people would click on the ad but it was all for the wrong reason. And this was proven because it would convert horrible even though on paper the ad looks like it is performing well. But on the flip side when they made ads about why their bikinis are better and showcasing all the designs even though the cpc’s went up they ended up making more money. So you want to have the product and its benefits as the main point of the video and maintain a somewhat professional tone. So people take your business seriously and actually know what is being sold to them with no distractions.",
    "category": "TikTok Ads",
    "source": "course"
  },
  {
    "id": 4,
    "header": "What makes a good advertisement",
    "content": "Since tiktok is a video platform what makes a good high converting ad is a good video or what we call an ad creative. The creative is legit everything when it comes to paid ads and although the way you setup your ads does matter. If you have a banger creative you really will be able to get sales no matter what way you setup the ads or campaign type you use. But combining that banger creative and right campaign setup is how you hit the big numbers and is what we will be showing you how to do. Now what makes this creative good is alot of what we taught in the organic course mixed with a strong offer or reason for them to buy. But let's break this down from the start again with of course your hook. Not much changes here from what we do in the organic videos as we still have the same goal of stopping them from scrolling and grabbing their attention. The only thing I will say though is that you do want to hook to be all about the product, with that being the main and only focus of the video. What I mean by this is shown well by the hytesoles video I went over where my hook was me stepping in the pool with my shoes on. Compared to the hook that also did well where I was showing all the levels of the insoles. If I were to use one of these as a paid ad hook I would use the one about the insoles showing them off. Both crushed on organic but again the pool example had more fluff and controversy that really isn't needed in your paid ad and all it will do is distract them from what you are trying to sell. A good way to do this in a paid ad is to call out an audience or state a problem the people you are trying to sell to have. So for a fun example if I was trying to promote this free course to someone who is new with dropshipping and wanting to learn. I would say something like “If you are ages 15-35 and want to learn dropshipping but don't have thousands of dollars to spend on a course then I have the solution for you!” Which might have even called you out watching this. But I'm sure you can see what i'm saying how this would make you listen a little more because it would relate to you so much if you are that person. Then moving into the “meat” of your video what you want to do is try to introduce every problem someone could have and solve it with the product. On top of that demonstrate every good feature it has in relation to them needing one themselves. You'd want them to have the reaction of “oh wow that's actually pretty useful” or “I know someone this would be perfect for”. Then to close out the video this is where we introduce that offer in which you hope is too good that they cant say no. At this point they will already hopefully be interested in your product and what you are showing but just need that little push to send them over the edge and purchase. Examples of this would be “30% off + Free Shipping Ends TONIGHT” “Buy one get one free sale ends at midnight” Basically whatever you are offering on your website anyway combined with the urgency of “its ending tonight or tomorrow” so they think they have to act fast. Buy one get one deals always do well especially for products such as jewelry because they are so cheap to get, allowing you to offer this while still being profitable. But for most products  it doesn't work as well which is why things like free shipping and whatever “sale” you are displaying on your website do just fine. In this offer or call to action you also always want to show them where to get it which on an ad there will be a button for this. I always just make it say shop now so what i'd say for the last sentence would be “__ sale + free shipping ends tonight so click shop now to get your own before it’s gone. And since I think learning by example is the best way to display this I want to show an ad I made which crushed for a recent youtube video about that folding duffle bag I have talked so much about already. This creative I am about to play is the one that brought in the most money at the lowest cost making it my winning “creative” which I further scaled up. (play creative 3) Started with a bold hook still focused on the product but catching their attention with a somewhat bold and confusing hook. To where I then demonstrate how it works showing its main famous folding feature. But what I said right here is what I think was the most important part. (play and well what does this mean part) I reminded them of a problem most have spending way too much money checking bags, and solved it by explaining this is a carry on sized bag that holds the same amount as a large suitcase. What this did was make it a no brainer to buy it if you travel a lot because really just after one use you will be saving money by using this bag. Don't pay $100 every time you travel and buy this bag one time for only $60. So now that they understood the value of it and how it works I show them where to get it on my website again showing that “sale” to increase urgency. I think when seeing examples like this it makes it obvious why some ads perform well and compared to other videos it makes it clear why those flopped. Just imagine if I didn't say this part about saving money and didn't show them where to get it. Well most people would just scroll past even if they think it's a somewhat cool product. People scrolling and watching videos need to be directed and shown exactly how to get it and why they need it. This is because most are in a relaxed state and almost braindead when scrolling so typically they wouldn't think of these things themselves if I just showed and talked about me packing the bag. Make it obvious and clear why they need it and where they can get it. And so far even though we will be setting up ads and sharing strategies on that soon It's all been about making the creatives because we want to really emphasize how important this is. So to recap the hook usually lasts anywhere from 3-8 seconds opening up the video. The meat of the video and demonstration usually lasts anywhere from 10-30 seconds. And the CTA is pretty quick at the end around 3-5 seconds. But keep in mind depending on the product and the amount of benefits you have to show this can vary but in general it stands true for most ad creatives.",
    "category": "TikTok Ads",
    "source": "course"
  },
  {
    "id": 5,
    "header": "Testing campaign setup:",
    "content": "So now that you know everything that makes an ad creative good and you have yours all filmed, put together, and edited from whichever way you picked. I'm here to show you how to set up and launch your first testing ad campaign. So to understand running ads the first thing you need to know are the different campaign types. So once in the tiktok ads manager which if you don't have an account yet just simply search “tiktok ads manager sign up” or use the link we will have below. And click into this top section where it says campaign. You will land right here and for you it will be all blank but this is an ad account I have used before so you can see all the campaigns here. So to run through this I'm simply just going to click create in the top left. And for this part you always always want to do advanced. (Run through all the advertising objectives) And once e click that you can see it gives the option to do a smart campaign which is a new feature tik tok has rolled out where it sets a lot of the audiences up for you but from my testing it isn't yet as powerful as just doing it yourself. So scrolling down you will see settings and here is where we pick the type of campaign we want to run. The main 2 are CBO which stands for campaign budget optimization and ABO which stands for Ad Set Budget Optimization. What ABO does is let you manually allocate a certain budget to a certain ad group. So if you have 4 ad creatives you want to test out you would be giving them each let's say $20 a day and they would spend evenly and on their own. To me this is more powerful when it comes to scaling so that will be covered later. But what makes a CBO different is instead of your 4 ad groups getting their own budget. You have one total campaign budget and tiktok will diversify that budget to your 4 ad groups. So one might get 75% of the budget which the others don't spend as much. And why this is so powerful is because tiktok is automatically giving the most spend to whatever ad group or video is performing best. This is what we want to do for a testing campaign because the whole goal of the test is to find which video performs best. So typically you will have this 1 campaign and under it will be 4 ad groups. Once the clock hits midnight all 4 will be spending the same amount. But as the day goes on and more and more gets spent, whichever video is getting you the most orders or the most clicks for the lowest amount of money will slowly start to get more of the spend. So even though they all started spending the same amount out the start of the day by the end, one will typically outshine the rest and get way more of the budget. Now tiktok isn't always spot on with this so throughout the day you do want to keep an eye on the campaign and sometimes you will have to manually adjust it. But this is something we will teach later on about how to analyze these metrics and tell which ad group to keep running. So i'm just going to name this DuffleBagCourseCampaign which you can name it whatever you want and it's only there to keep you organized. So you could name it something like first testing campaign. Then right here you will see Campaign Budget Optimization so we just have to flip this on and put in whatever our daily budget will be. Most people start with $50-$100 but it's nice to know that this spend isn't guaranteed. If you wake up in the morning and it's super unprofitable with horrible metrics you can turn it off whenever. So I'm going to put $100 and we can move along by clicking continue. (Setup Full Camp with 4 bag videos). So when it comes to analyzing metrics, what I do along with most people is basically have in mind certain statistics to look for that outweigh others. I will be going in depth on this when we have the ads manager open but the best example I could give would be having the CPA as #1. CPA is the cost to get an order so obviously to make the most profit we want to keep running whichever ad group has the lowest CPA. No matter what the other metrics are if one is getting me orders for the lowest price, I'm gonna keep that on. So to give real examples of this I'm gonna pull up the campaigns I ran of this bag product with the same exact videos I just showed in the live setup. So this right here is the ad group level of what was called duffletestcampaign. Which started exactly as I just showed. 1 campaign, 4 ad groups, 4 videos. Give the general explanation on metrics talk about how these weren't great metrics but how I was able to see #3 was the best and how ad accounts sometimes take some time to optimize",
    "category": "TikTok Ads",
    "source": "course"
  },
  {
    "id": 6,
    "header": "Explain how camps die out quick",
    "content": "Hint at scaling by showing the other ones relating to what I said about metrics. So whether you had a profitable test doing what I showed earlier and you are ready to scale or you just want to get an idea of what's to come in your dropshipping journey. It's time to get into the real fun with paid ads which is scaling. With scaling there are no limits and this is where you can hit the crazy numbers I'm sure you have seen online. But also it's not like you have to jump right into the deep end and spend thousands of dollars a day because with the different types of scaling I am about to explain, it can be done at any level and at any budget. The whole goal is just to take your product to the next level and out of the early testing phase. But before covering the real scaling strategies I want to explain the first step I do to get out of the testing phase. So if you set your testing campaign up exactly as I did in the live setup with 4 ad groups each with their own video. Once it has spent for 1-3 days if this is a good product you should start to see one video or ad creative start to outperform the others. With a lower cpc and hopefully lower cpa. What you want to do is create a brand new campaign, with again 4 ad groups, but have all ad groups be that one winning video. Don't get too excited and start upping budgets like crazy yet, but just do the same budget with the same process of analyzing the metrics. What we are trying to do here is just confirm this video and product has what it takes to run at higher budgets. So through the testing we are trying to find our winning video, and in this phase we are just trying to confirm this video is good and will continue to be profitable. And if on the first day it isn't profitable right off the bat, if you have the confidence in this product let it run for at least two days. Because like I mentioned the ad account takes some time to optimize and through the pixel find what types of audiences would buy it. So if it makes it through both those phases we can now start increasing the budgets and scaling. So to understand scaling you need to understand the three types of scaling. Vertical and horizontal are the main 2 options but we also have something called surf scaling. They are pretty self explanatory and all in the effort of raising your budget which hypothetically raises the amount of orders and money you make. And I personally do a mix of the three which I'll be covering in a second. But let's say you want to get to the point of a $500 daily budget, I made this graphic to demonstrate it. With vertical you are simply just changing the budget on your existing campaign or on a new campaign and raising it straight to that $500. So to get to that $500 you are just going straight up, vertically. Now horizontal is where instead of raising it on the one singular campaign you are making 5 $100 campaigns. Your daily budget is still that $500 but it's spread out horizontally across 5 campaigns. I personally prefer horizontal and that's because even though all the campaigns are set up the same, sometimes 2 out of the 5 will be unprofitable. So by going horizontal you are basically giving it 5 chances of finding that profitable campaign rather than with vertical if this one flops well you have no others. And this is where surf scaling comes into play. Let’s say 3 out of the 5 are profitable right here. Well throughout the day what I can do is up the budgets on those to keep growing. If it stays profitable at $200, then I can go to $300 and so on. Surf scaling is much more hands on where you are watching the metrics throughout the day and turning off/upping the budgets as it continues to spend. Like I said I really do a mix of the three so if I was profitable with those 5 $100 campaigns in a few days I would do the same setup of 5 but have them start at a $200 budget. So basically horizontal vertical scaling. To where then if I want to, it is the same process of upping and surf scaling those budgets as the day goes on. For my biggest winning product there was a point where I was spending around $10k a day doing this exact thing. Typically 10 would have a $1,000 budget starting the day and some would hit, others wouldn't, but I would just turn off the bad campaigns and start surf scaling the good ones. Another thing to note is when your budgets start to grow, it is smart to have more than just 4 ad groups under it. Which is the same idea of why I like horizontal scaling. The more ad groups you have, the more chances you have for one to hit and be profitable. Which when I first started used to confuse me because all the ad groups and campaigns are set up the exact same way. But some work and others don't because tik tok is showing each of them to a different audience and different groups of people. Some dropshippers like to keep old campaigns running for weeks on end but what I was doing at this time was creating 10 new ones a day. Because for me they would tend to die out after a day or so. And for me these were always CBO campaigns. I basically would wake up, analyze the metrics and right away turn off the unprofitable ones and keep the profitable ones. Then as the day went on and more spend and orders came in I would start to surf scale the ones that stood out. Then at night create new campaigns to repeat the process the next day. Everything becomes very simple with paid ads once you find that winning product and have a winning ad creative. It's more just managing although you do have to frequently be making new videos because like campaigns those die out too. Although the process becomes much much easier as if you remember from the organic section a huge part was rinsing and repeating viral videos. Well once we find the advertising angle that works on paid ads we can just rinse and repeat it on there. Make slight variants of what worked and test them out how we did before. So to lastly recap on the process from finding a product to reaching thousands in sales with paid ads, I would do it like this. I find and evaluate the product using everything covered previously in the course. I then create 4 ad creatives based around the product showing its benefits, uses, and more. Then I set up my first CBO testing campaign. This has 4 ad groups each with their own video. I let this spend for 1-3 days either making new campaigns for the next day or keeping this original one running depending on my results. All while analyzing the metrics to see what creative is working and if this product is a true winner that people are buying. Then I take whatever ad creative is doing best and copy it into its own CBO where all 4 ad groups contain this one video. If it continues to do well, I will start horizontally scaling it. First day I will have 2 campaigns or copies of it running. Second day if it continues doing well I will have 4 campaigns running. Third day I will go to 5, 6, 7, 8. Basically slowly creating more campaigns and duplicating what worked the day before. And what makes this very simple for my strategy is the fact that I always use CBO campaigns. Which you just set up the same way I did in the testing campaign live setup. All that changes is your budget, the amount of ad groups, and what creatives these ad groups have. All of this stuff will start to make more sense once you are actively running ads and hopefully scaling up yourself. But I hope through the diagrams and explanations you are able to understand the fundamentals of running these ads. Dom and I are also working on building a new store and dropshipping business which we will be running strictly through paid ads giving day by day check-ins and actually showing you the live process of making creatives, testing, scaling, everything. So you can see it in real time and understand our thought process behind all of this with paid ads. So depending on when you are watching this it may already be out which will be in the sections after this or we are still working on it so again the best place to get updates when we release new info into the course are on our instagrams. But quickly Dom will be going through some final important things to remember when running paid ads in the next section.",
    "category": "TikTok Ads",
    "source": "course"
  }
]