[
  {
    "id": 1,
    "header": "Shopify Website Build",
    "content": "﻿It's now time to take your first step into the dropshipping world by creating your Shopify store. Shopify is a dropshippers home, it's where we will be building the website, this is how we receive, manage, send orders, everything. Now this used to be kind of a gruelling multiple hour process setting up landing pages, legal information, and all the tedious backend work. But with the growth and advancement of AI all of that busy work we used to have to do, is now done for us in just a few minutes. Allowing us to instead focus on the actual websites design like logos, colors, photos, and of course the marketing which is what really matters as that's what makes us money. So to access the AI store builder, which is 100% free, just click the top link in the description under this video or search it manually if you prefer that. You should land on this exact page but before we dive in just double check that you see the study dropshipping logo right here. This makes it so you can follow along step by step and actually get the website design we created for you with build your store. Alright so now that we're on the same page simply click “build my free store” which will lead you here. Add your name, email, create a password, and click next. Now it is asking us to pick a niece like fashion, pets, electronics although this is something we will be focusing on later when we find a product but we will go with electronics. Which does not mean you have to dropship electronics, this is just for the sake of getting setup. Again the banner is something we will adjust later so you can select any 2 of these and click done. But here is the important part where we will be signing up for shopify which again is where your website will be built. So as it says just click “access shopify” which will open up in a new tab. Put in whatever email you'd like here and click start free trial. Now just create a password for your shopify account and obviously click “create shopify account”. Since I am here to guide you through every step you can just click “I don’t want help signing up” and here where it shows the plans “skip i'll decide later” Now head back over to the build your store tab and click done for this step. Next it wants us to link the shopify store which coming back over to shopify you now have access to and all you have to do is select the url here, click copy, come back to build your store, paste it in here, click save, and done. Next step is to claim our discount so let's head back to the shopify tab, click select a plan in the bottom right, select basic, and here is where you sign up. Since you are using the link through our build your store page you get the 3 day free trial, but most importantly your first 3 months are only $1 per month rather than the normal $39 a month. Which is really a blessing from shopify for new dropshippers as it allows you to learn and start making money with really no risk. And likely by the time those 3 months are over you'll be making far far more than the $39 a month to keep your store running. You can pause the video here to add this in yourself but I just added in all my details so I'll click subscribe, click add later on the address (do the address), and click done on the build your store tab. (you may have to refresh) We are almost done here with just a few steps left so lets click install app, install, good to go on that. Now click customize my store, let it do its magic, then register to autods (need to do it on a different tab without my account there), done. This part for tiktok ads will come later in the course so all we're gonna do is click the “get free ad credits” button, keep this tab open, but come back to it later so again we can click done. And finally the last step is publishing our store so click here to open that page in shopify, untick this box to remove the password on your store, and click save. Now lastly come back to the build your store tab, click done, and we are finished. So I want to say congratulations to you for taking the first step and launching your first store as from what we've seen only about 10% of the people who say they want to start dropshipping even get to this point. We still have more work to do but to see what the AI built just click access my store and it will bring you to this preview. When we're really ready to launch this website will look completely different as we're gonna be giving you a custom theme and you will likely have different products. But what the AI has helped us with are all these backend pages here like the return policy, track your order, and more. Which, like I mentioned, takes a ton of time if you instead did it manually. Automatically a few products were added but they are pretty outdated and in the next chapter dom will be showing you how to find real winning products and step by step sharing the strategies we use to find our 6 figure plus products. So once you learn all about that and find your product with Dom i'll be waiting in the next chapter showing you how to customize this website around your product and turn it into a money printer. \n\n-",
    "category": "Shopify Store Build",
    "source": "course"
  },
  {
    "id": 2,
    "header": "Shopify Website Build",
    "content": "Now that your website is built by AI, ready to be customized, and you found a product… It's now time to turn this product into an actual business with a professional website built around it. This chapter will be split into 2 main parts, a website overview and the live website customization. In the overview I will be going through what makes a good website, comparing good and bad sites, and explaining why the website is so important in relation to you making the most money. And in the live customization I'll be going through everything from logos to colors to product descriptions step by step. So by the end of this chapter you will be ready to start selling your product and making money. \n\n-",
    "category": "Shopify Store Build",
    "source": "course"
  },
  {
    "id": 3,
    "header": "Shopify Website Build",
    "content": "First things first we need to make and come up with a name for our product and our store. At this point you guys are probably sick of me saying branded or the branded feel of your store but your name actually ties into this massively. Without a name you have no brand and without a brand you have no one product branded website like we went through in the examples above. So for reference in this entire website tutorial I am going to be creating it based around this product right here. Which if some of you know me before watching this course you've probably seen the multiple youtube videos i've posted actually dropshipping it myself and finding success. But since I want to do this all from scratch with you I'll be picking a brand new name, making new logos, new everything. So when it comes to naming you wouldn't just name this the folding duffle bag. It would be something like the examples I've seen others do such as mycarryall, luggo folding duffle bag, travel flex bag, ect… And the best place to get a name like this is a ai tool I found  and have been using for awhile called namelix. What you do is add keywords so I put “luxury folding duffle bag”, selected brandable names, medium randomness, and it then gives a ton of options to choose from. Personally I look for the one word names so that i can have the product title be something like ___ folding duffle bag. (Scroll through and pick a name) Ok so we have our name and believe it or not the first step we are going to be taking is creating a brand new gmail. Reason behind that being you want to keep your personal life and emails separat–e from your business and dropshipping info. When you guys soon reach the point of scaling up and getting hundreds of orders a day you will be thankful you took this step so that customer emails, shopify info, and business inquiries are all separate and organized. So simply just google create new gmail and make one based on whatever the name you chose is. As you can see I put _______ and now that we got a name and an email it's time to head over to shopify and sign up under this email. And I assume you may have already signed up to Shopify in chapter 2 with Dom and that may have been under a different email but in just one second i'll show how you can change that to this new one. But for me i'm going to be using our link which again it would be much appreciated if you would use our link as that's what makes it possible for us to build this and give out this info for completely free. Click start free trial (Go through all the questions) and this will lead us to what's called our shopify admin home page. Shopify will automatically give you guides on what to do but you don't need to follow those as that's what we will be doing in this video. First off we will be setting up our product page with descriptions, photos, and pricing, then doing all the backend and legal info you need to add to actually be able to get paid, and then actually building and customizing the website. Saving the fun part for the end but doing it in this order makes it the most efficient. But quickly (show how to change email) \n\nMedia is the very first step… The reason that photos are so important is because that's the first thing customers see when landing on your website. And what we are looking for are clean photos with mostly all white backgrounds. If your product needs to be demonstrated with a different background it makes sense but at least for the cover you want a clean white background that just shows off the product and gets straight to the point. The photos are one thing a lot of beginner dropshippers mess up on because 1 it's not exciting and 2 doesn't seem like that big of a deal. But you just have to put yourself in the shoes of a customer and think about how you would feel if the photos were blurry or showing too much. All the red flags would be going off saying it's a scam. So the first place we can look is just a simple good search. On top of that amazon listings can have some good photos. And a big one is finding photos on your competitors website as long as it's not branded to their name. So before filming I saved some photos myself so we all can save time. They all have white backgrounds and simply show off the bag and all its different variants along with 2 of them showing off all the features. All of them are also the same shape, this small square which I did by just opening up the website canva, signing up, create design, logo, and adding and adjusting the photo here.",
    "category": "Shopify Store Build",
    "source": "course"
  },
  {
    "id": 4,
    "header": "Shopify Website Build",
    "content": "1. Build full product page using autods and through adding products normally\n\nExplain name, description (insert gif but show how to make them), photos, pricing, variants",
    "category": "Shopify Store Build",
    "source": "course"
  },
  {
    "id": 5,
    "header": "Shopify Website Build",
    "content": "3. Legal navigation pages (aftership affiliate?)\n\nShow how to add them and get them on the website\n\n4. Online store with zip file (debutify affiliate?) (loox affiliate?)\n\nColors, home and product pages, checkout, reviews\n\n5. Final overview of url redirect, discounts, analytics, and store",
    "category": "Shopify Store Build",
    "source": "course"
  },
  {
    "id": 6,
    "header": "Shopify Website Build",
    "content": "Getting to this point right here with a winning product, clean website, and all the backend setup is a win in itself and statistically way less than 50% of new dropshippers even get here. So you should be proud of yourself just for that but to actually start making money comes time for the advertising. You can't make money from this website if you aren't getting people on this website and in my opinion this is by far the best part. Although with that being said there is a ton that goes into successfully being able to advertise a product. And although I know this whole course so far has been packed with value, this is where Dom and I really take pride in what we teach. Throughout all of our accounts combined over the past few years we have gotten hundreds of millions of views potentially close to a billion. Which most of those being product focused and dropshipping videos. And even though we will teach literally everything we know for organic and paid advertising if you do want to have longterm success with this your mindset needs to be in the right place. So before the big advertising section Dom will be taking you through a mindset course covering ideas that if followed can almost guarantee your success in the long run and make you basically unstoppable.",
    "category": "Shopify Store Build",
    "source": "course"
  },
  {
    "id": 7,
    "header": "Shopify Website Build",
    "content": "Sorry to interrupt but I just finished filming and realized I never really explained what autods even is before telling you to sign up. As you know this course is 100% free but even if you paid for a $5,000 course the 2 things you'd still need to pay for are Shopify and a supplier. Autods is my supplier of choice which is basically an all in one tool to help automate the process of getting your product to the customer when they order. Because if you remember the dropship model a customer places an order on your Shopify store paying for this example $30. You then purchase this product from your supplier, autods, for only $10. Who then will automatically send this product directly to the customer without you ever touching it, profiting you that $20. Later in the course I go through every feature of autods and show step by step how to set it up but I just wanted quickly to clarify what you're even signing up for.",
    "category": "Shopify Store Build",
    "source": "course"
  }
]