[
  {
    "id": 1,
    "header": "Part 1 - Introduction to Series Content",
    "content": "So what is this “series styled content?” It’s very simple - series styled content is just content like this guy is doing here with his toy gun product. He opens up the video by taking a comment request from a viewer as to what gun he should make next, then he responds to them. Another type of series is something like this, “Part 1 of wearing these insoles around my friends to see if they notice that I got taller.” What isn’t a series is something like this. [ONE TWO THREE] Although these guys are making the same types of videos, the “prototype vs. product”, these videos aren’t strung together at all. They’re just remaking a video framework that has performed well for them before. There’s no CTA at the end of the video to get people to comment something that keeps these types of videos moving, and all of these videos stand on their own. What’s great about series content is that, when you find one that hits, it makes content very simple. You’re able to just continue riding this wave of your series and because it’s a series it results in more engagement, but more on that later. Let’s take a deep dive into what makes a series powerful, how to best execute them, and everything in between.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 2,
    "header": "Part 2 - Series Style 1, Comment Challenges & Requests",
    "content": "The first type of series style content is replying to comments that either request something from you or challenge you to do something with your product. If we take the toy guns for example, the series here is that people will request a certain type of gun to be made, and the guy will either show that he has that type of gun or let the audience know that he’s working on one for them. That’s a series of comment requests. Another one is a variant of that, and that’s comments that challenge your product. For example, Mike had a successful series with the flying spinners when people would comment “I bet it can’t fly outside” or “I bet it’s not durable”, basically challenging Mike to disprove them. This is a series that focuses on disproving, and it can be great because it gets the idea across to the audience that this is your product that you are selling and it also promotes your product as a whole. One more example of the comment request type of series is what I was doing with the Vortex Bottle. I would take requests from my viewers for what type of drink I should make whether that be a protein shake, a preworkout drink, or anything else. I’d make the drink, show off my product, then close out the video by telling the audience what to comment what they would like to see me make next. You can see how there’s a little ecosystem that happens with these serieses. Since I’m taking comments from the audience and using that to open up the video everytime, viewers realize that they can comment and have me make whatever drink they want, so this results in more comments. As well as that I have a CTA at the end of the video saying “comment what you think I should make next”, something that I wouldn’t be able to do if these videos weren’t in a series. Also these types of videos result in more followers, because people know that I’m going to keep making good content like this.\n        Right now I want to analyze the success that Skorpion Shot has had by doing this comment request series, and how it’s better than just making one off videos. [ONE TWO THREE] First, these videos open up with a comment request everytime. This shows that the account is very engaging with their audience and almost makes it easier for people to get in the conversation in the comments. Because the guy will read the comment, then answer it and talk to the person like they already know them, it creates a really good community feel for everyone. Next, because this series of taking requests for different gun models has been so successful for so long, people recognize that and comment what gun they want to see next without the content creator really having to prompt them to ask that. That boosts the engagement and therefor the performance of the video because there’s so many people commenting. Also one thing to note that he does so well that isn’t really specific to a series is that he opens a question at the start of the video but never answers it. What this does is piques people’s interest and makes them curious after the question has been posed, and now they’re more likely to watch the video until that question gets answered. And since the creator here knows that they’re gonna be waiting on that answer, he takes the time to plug all of the guns and benefits of them. Lastly, he doesn’t even answer the question that he originally posed, which will get people angry and maybe have them commenting, boosting the post. This is a very smart technique that I see everyday work time and time again. But to wrap up why his series has been so successful, he just found a marketing angle that works and has run with it. Open the video with a comment requesting something, state something that will get the audience curious, take the time to plug your products, then never answer the question. It results in tons of comments of people asking for the next model of gun to make, results in higher watch time because he never answers their question, and likely results in more customers because he’s plugging his products a ton while they wait for their question to be answered. This is exactly why it’s important to have a product that can create content forever just like this one, people will never run out of guns to request. But to wrap up what I want to say on the first style of series content, we’re going to cover one of my old TikTok dropshipping accounts, Vortex Bottles.\n        So Vortex Bottles as a store I would actually consider to be a failure. The product was priced way too high and I converted views to customers terribly. My profit margins were also poor and I failed in these areas because I was such a beginner at the time. However, I will say that the content absolutely was a hit. I found a series style that hit and I’m going to tell you all about it right now. So what the product actually was was this portable bottle blender. It’s great for protein shakes, preworkout drinks, and just overall mixing whatever drinks you wanted mixed. So right after ordering this product from Amazon to my house I started brainstorming content ideas with it. What I thought was that since it’s a blender bottle, I should be able to effectively show off my product and also make content interesting by just taking requests for what people want to see mixed. So that’s exactly what I did. When I got comments like “make a preworkout drink” I would take that and make a video out of it that followed this framework: Open up the video by reading the question (make a preworkout drink?) then i’d say something like “bet I got you”. What would be going on at this point in the video would just be me pouring preworkout into the bottle with water spinning, then I’d zoom in on it mixing because it looked satisfying. But while it was blending I would take that time to tell the audience something like “this is the Vortex Bottle, and it literally mixes anything, so I’m sure it’ll be able to make a preworkout drink”. So if we take a step back, about 6-8 seconds in the video the audience is still waiting for their question to be answered, so they’re very engaged with my video, the background video has been very stimulating because the drink looks awesome when it’s blending, and they know the name of my product and the big claim “it can mix anything” after that I would dump the drink into a cup through a sifter to show that there were no clumps and that it mixed perfectly, and I’d pose the question to the audience “comment what I should mix next.” This video series is perfect because it has everything that one needs. We take a request at the beginning of the video which makes the audience now wants to see satisfied, we use the meat of the video to plug our product and show off how good it is, then we close it out with a successful performance by our product and allow the audience to decide what we do next. In total from this series I brought in just over 8 million views in 2 months, with almost every video getting great engagement asking for a specific request and lots of followers  because of people wanting to keep up with the series. So for short form marketing you definitely want to tap into lots of series content if it’s possible, because they’re proven to be extremely powerful. To help give you some more ideas as to what kinds of serieses you can make, i’ll brainstorm that with you after I tell you about the second type of series styled content.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 3,
    "header": "Part 3 - Series Style 2, Part 1 of…",
    "content": "The second type of series content you can make i’m going to be covering now, and that’s simply part 1 of… Some examples of this series would be “Part 1 of pranking my Dad with X product until he figures it out” or “Part 1 of using this cool board game with my friends.” With these serieses you basically just want to try them, and if they hit you go for as long as you can with it until the angle has burnt out. And if it doesn’t seem to be hitting then I wouldn’t keep tyring to get it to hit if it hasn’t after a part 3, so that’s 3 total times of you posting the series. When it hits though, just replicate everything except for the variable aspect of the video. For example, how we talked about with the Vortex Bottles, everything in the video was the exact same except for the actual thing that I was mixing. And for Mike trying people’s challenges with the flying spinners, the intro and outro were the same, it was just the meat of the video where he was doing the challenge that the video would be different. I have some examples of me and Mike doing this type of series with our Hytesoles account and I’m going to go over them with you now. The first series that we did was “Day 1 of hiding these from my friends until they notice” where we would basically show the insoles then just get straight into some type of funny skit. This worked great with our product because it was just natural, funny content that was completely focused on the product. We actually ended up making 10 parts to this series and brought in a total of 585,500 views throughout the series. Our biggest video from it was part 2 which brough in 356,300 views, and the reason why we eventually stopped this series is because the views on every part were consistently decreasing, so we could tell that the series was beginning to burn out. But really this was a very simple series, you can see that we would just open the video by showing the product, and the variable with this series was just the skit or funny thing that Mike would be doing when hiding the insoles from me. I want to go in depth here and analyze this series more for you, but it’s really just so simple. We though of an idea that we could continuously make content for the product with, like hiding it from friends, and after testing the idea with a couple videos it hit, so we kept the skeleton of the winning video and just made the skit something new and funny everytime, that’s really all it is. The next series that Mike and I ran with this product was a remake of this, “Day 1 of wearing these around my wife’s boyfriend until he leaves”. We started doing this series because we knew that the series before had worked, so we just combined it with a hook we had seen to be proven time and time again, the wife’s boyfriend. Our thinking here was that we’d keep the same skeleton from the series before where we just opened by showing the product, then we would have a skit where Mike comes up to me trying to intimidate me with his new height that these insoles gave him. So that’s how we did it and from the first video we got over 32,000 views so we kept at it for 4 parts, when the series got burnt out. And that’s not a failure at all, to have it only go for 4 videos instead of 10, it just didn’t hold the same weight as the series before and obviously you don’t want to keep trying to revive a video angle that isn’t bringing in views anymore. In total this series brought in 75.4 thousand views, with the biggest video being that first one at 32k. So that’s the second type of series content you can make, part 1 of… and it’s a very simple, easy way to make content and when it hits it’s HUGE for your account because you’ve already got the skeleton of the video down and serieses result in more follows and more engaged followers.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 4,
    "header": "Part 4 - Brainstorming Serieses for Different Products",
    "content": "‘Dom, I know that series content is great, I know that it will result in good engagement, but I don’t know how to brainstorm these series ideas.’ Well that’s exactly what this part of Chapter 8 is going to be all about. I’m going to present to you a couple of products that I found on my TikTok burner account and give you ideas as to what types of serieses you can make with these products. Honestly this isn’t the easiest thing to brainstorm, because most people don’t tap into the power of series content, so you can’t just scroll their account until you find a winning series, a lot of the time you have to completely brainstorm it for yourself, but that’s why I want to do that for you so that you feel confident doing it yourself.\n        The first product I’ve got is this galaxy moon ball. There’s tons of videos that have gone viral with it, but we want to tap into a series with it, so what can we do? Well we notice that the main controversy behind this product is its bounciness. Because of this, we can do a comparison type series where we test different balls against the moon ball. We could try a lacrosse ball, baseball, basketball, golf ball, and anything else really. This series would do great because people EAT UP side by side comparisons, and the moon ball of course is going to win everytime so it makes your product look good. Here you can see the skeleton that I’d follow for this series: just open with a basic hook, get into the comparison, and ask the audience what ball they want to see tested next. The next type of series that I would do for this product is proving that it’s real. Mike succeeded with this type of series with his flying spinners, and i’m sure that success would translate to this product too. You can reply to comments saying things like “prove there’s no string in your hand” or “prove it’s not reversed” and “prove there’s no green screen. This comment in itself as a hook is great because it gets the audience excited for whatever you’re about to show, since it must be so cool that people are asking you to pove that it’s not a green screen. Again, I have the skeleton for a series like this right here for you. I really think that both of these sereieses could work and all we had to do to come up with these ideas was lean into the natural controversy of this product and get creative. That’s really all that goes into coming up with a great series idea.\n        The next product that we could make a couple of effective series from is this bow shooter. This is just a simple rubber bb shooter but it’s capabilities come from what you can do with it in public. I actually had some students and friends in the past doing serieses very similar to the two I’m about to share with you. So right off the bat I think about what controversy this product holds. It’s a cute little harmless shooter so right away I just think about if we were to mess with people with it and get their reactions. So the first series that would do well with this product is shooting people at different stores, and every part of this series is a new store. For example you could do a compilation of shooting people at Target, then Walmart, then Home Depot, and literally any other store after that. Close out these videos with “what store should we go to next?” Then the next series that we could do is a spinoff of that, which is shooting specific people. We could reply to comments like “shoot a skater as he’s rolling by” or “shoot a student in class” - but we have to keep in mind that this series will only do well if these people’s reactions are actually entertaining. If they’re not, then there’s no reason for people to laugh or share this with their friend. So if you ended, you can have a friend be your actor for all of these. But that’s how this product could blow up is with going to different stores and taking viewer’s requests to shoot specific people.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 5,
    "header": "Part 4 - Brainstorming Serieses for Different Products",
    "content": "Making content out of anything",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 6,
    "header": "Part 4 - Brainstorming Serieses for Different Products",
    "content": "* Show how “boring” products such as supplements or a neck cracker turn viral",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 7,
    "header": "Part 1 - Making Content Out of Anything",
    "content": "A skill that you’re going to develop over time as you continue making short form content for dropshipping products is really being able to make content from anything. Of course some products lend themselves to content, but others don’t. You need to know how to make “boring” products like a supplement or a neck cracker go viral. You need to develop the skill of taking a seemingly boring thing and turning it viral. To help you understand how to do this, I’ve got 2 products with me.\n        The first product is this light for reading books when it’s dark. That’s right, literally just a book light. Obviously this product completely lacks a wow factor, and as far as making content with it, what can you really do? Even I struggled to think of how this thing could go viral, but one of our students actually found a great angle that I want to share. Instead of talking about how this book light was “one of a kind” and “very useful”, the whole marketing angle that this person went with was religion. What I mean by that is that this light was branded as a book light specific for studying the Bible at night. And in the videos the person would say things along the lines of “I converted from Islam to Christianity and my parents have disowned me because of it, but now I’ve created this light so that anyone can study their Bible at night too”. This resulted in tons of controversy in the comments because Muslims and Christians would just start arguing about their differences, and it also resulted in some muslims giving the person a tough time for converting. But then christians would be very welcoming most of the time, saying “welcome to our religion.” this isn’t the most product focused type of video to blow up with, but nevertheless, the person blew up a very boring, simple book light just by creating a story around it. And if you take anything from this, then understand that if you have a great, effective story, then you can rally find a way to tie any product into that story. Then the video pops because of the story. \n        Secondly I have this back cracker that I want to show you. At first it may kind of seem like a product that serves a purpose, it just doesn’t feel like you can do challenges with it or create a ton of desire with it. Well I’ll tell you that there’s actually a LOT of content that we could do with this back cracker that you may not have first thought of. The first angle that people have ran is just this one where different people try it, and they add in some sound effects to make it sus after they’ve cracked their back. What’s great about this framework is that although it gets kind of sus with the moaning and groaning sound effects, it shows off the product brilliantly and the whole video is completely focused on the product and how good of a crack it gives off. This is a variant of that where you’re just putting any type of hook to open up the video then cracking your back and moaning at the end. This isn’t even bad controversy either, because to moan when your back gets cracked so loud is pretty normal. It’s just a great way for you to blow this product up. Really all you have to do is take this angle and run with it. Go up to strangers and see if they want to try all 3 levels of the crack. Call out an audience like people who go to the gym and create story to where you got hurt and could never lift as well as you could before anymore so you got this backcracker and after a week of using it you’re hitting PR’s like crazy. Once you’ve found an angle where you can just crack your back for example and add a bit of a moaning sound effect, you can create any story around it, have any type of person test the product, you can do prank videos with the product by pranking your mom while you’re using it that you actually broke your back, anything like that. It’s very possible to make a boring product go viral.\nABOVE DONE",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 8,
    "header": "Part 1 - Making Content Out of Anything",
    "content": "19. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 9,
    "header": "Part 1 - Lighting PART A",
    "content": "A lot of things go into creating a good video, but what Mike and I have always taught first is good lighting. Without good lighting, your video is extremely less likely to succeed, it’s just that simple. You can’t make a good video without good lighting, so I’m going to cover what you need to know while filming to ensure you can get the best possible lighting on your product.\nFirst off, natural sunlight is always preferred. I don’t even fully know why, but it just looks so much better and obviously, more natural. But right now let’s move away from my desk set up, and we’ll do some live recording looking for good lighting outside and around my house. [a]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 10,
    "header": "Part 1 - Lighting PART A",
    "content": "19. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 11,
    "header": "Part 1 - Lighting PART B",
    "content": "[From here you should get a product in hand and do a live recording outside of you finding the best possible lighting with it. To record it live would probably be the best thing you could do here][b]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 12,
    "header": "Part 1 - Lighting PART B",
    "content": "Bullet Points to follow when recording live:\n* Start in the room and go around talking about how you want to hunt that good lighting and how some stuff could be backlit\n* Go to the balcony and talk about the backlighting there\n* Go into some closet and show the difference there",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 13,
    "header": "Part 1 - Lighting PART B",
    "content": "20. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 14,
    "header": "Part 2 - Phone Quality (iPhone)",
    "content": "The next thing you need to know is that you most certainly need an iPhone if you want to be posting high quality short form content and making good ads yourself. Android quality just won’t work here. As far as camera settings, to record on 1080p at 60fps is the best in my experience. So just go to your iPhone settings, go to camera, then just make sure it says that you’re recording at those settings.[c]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 15,
    "header": "Part 2 - Phone Quality (iPhone)",
    "content": "21. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 16,
    "header": "Part 3 - Pacing",
    "content": "Pacing in your videos is so important, because if it’s too fast people won’t be able to follow along your video effectively, although this rarely happens, and if your video’s too slow then people will get bored and scroll off of your video. With me I have 3 videos. One that’s too slowly paced and 2 that are just right. There’s really no such thing as too fast of pacing besides a few exceptions. If you’re trying to go in depth and tell an emotional story with lots of text but cut too fast away from it then you don’t give people enough time to read it, but since that’s really the only thing I can think of, we don’t have to talk about too fast of pacing. But for now, let’s analyze these 3 videos.\n        This first video is paced too slowly. There’s not a single cut in this video, and it’s just 2 pieces of text. Although Cars is playing on the monitor, it’s not interesting enough for someone to be entertained all the way to the end of this video. You can rarely get away with having a video be just one shot, and honestly there are very, very few instances where I’ve ever seen that work for a product. People want to be entertained, and it’s hard to do that with 1 shot, especially when the angle doesn’t move at all and nothing is really happening in the video. What could’ve been better here is the person showing the projector, getting a few cool angles of themself setting it up, then showing lots of different things playing on the monitor from different angles. Another shot I’d love to see is 2 people watching the monitor, because that helps the customer get a feel for what they will be experiencing when they buy the product. I do think that they do this in most of their videos, so I don’t know why they wouldn’t do it here. But again, like I said, this video is too one dimensional, it’s not entertaining, not stimulating, so therefore it performed poorly.\n        So what pacing do we want to strive for? Something more like this video: no shot is longer than 1.5 seconds which is great because it doesn’t allow the video to get stale and have someone get bored or unstimulated. I personally don’t always follow this rule, but I know lots of people strictly won’t let a shot go on for longer than 2 seconds. Again, this is because if you have a shot that’s 5 seconds with not much going on, people can get unstimulated and scroll. That’s really just what the game is with short form content. But this video is GREAT with their pacing. Within the first 2 seconds we’ve already been introduced to the product, then the next 3 seconds quickly and effectively show how the product works, and after that for a few seconds you see the magic of the photo being uploaded to the back of the phone case. Then the video closes out another few seconds of just showing off the final product. The product is self explanatory, so you don’t need to have long shots of you voicing over in monotone talking about how great it is. This video is a prime example of being very quick, condensed, and to the point. Understand that people are able to piece certain things together about your product, you don’t always have to spell it out for them. And that’s one more interesting thing about marketing, is that even if they don’t piece it together right away, that’s a good thing because then they’re going to feel the need to watch your video until they understand it, giving you better viewer retention.\n        Onto the next video with great pacing, which I was actually thoroughly entertained by. This video is 30 seconds long, almost 3 times longer than the video before, but it’s paced soooo well and the song is nice and upbeat, making the video feel like it’s moving even faster. These guys literally hacked some part of my brain with this video because I was so intrigued watching it to the end. So let’s analyze it. First off, again, there’s only a few shots longer than 1 and a half seconds here, and if they are then they’re sped up. There’s a total of 26 shots in this video through 30 seconds too. Not like they need to be striving for a certain amount of shots per second, but it’s just interesting to think about. What really helps these guys I think is that their product is naturally very satisfying. For example you can see in the 3rd shot that it’s so interesting how that wax clumps up, and it’s very unique. Then when they smooth out the sand and place the little wicks into it, that also feels very stimulating. Just understand when watching this that they’ve combined an upbeat, happy song with satisfying, well lit, intriguing clips that are extremely condensed. There’s no fluff here, they’re as to the point as can be. And that’s what you really want to strive for in your videos. Because all of these other creators know how to get ot the point and exclude fluff, just look at some of Mr. Beast’s short form content. Every single second and every shot serves a purpose. There’s unique cuts, shots, and sound effects coming at you in different ways that keep you on your toes. So remember, just like these people did so well, keep your audience on their toes.\n        Before leaving the pacing part of this organic chapter, I just want to look at the hook of this Mr. Beast TikTok so that you can understand the amount of things that happen so quickly. Of course we’re not making Mr. Beast content, but it’s good to know what the GOAT of content does with his pacing. Just look at what’s happened 4 seconds into the video. There’s 5 shots and they all have animations on them, the camera’s constantly moving, there’s already been 4 sound effects added as well. And after this of course there’s much more great editing and fast pacing, but you can go through that yourself. I’ll let you know though, if you’re serious about understanding how the greats pace their videos, just go through Mr. Beast’s TikTok. And I would bet that in none of his videos would you be able to find a dull moment where someone could get bored.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 17,
    "header": "Part 3 - Pacing",
    "content": "22. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 18,
    "header": "Part 4 - Transitions PART A",
    "content": "Transitions are a very important part of short form marketing and although they’re not necessary to make a great video, they can make your content a lot more interesting and spice it up a good bit more. So what I’m going to do is equip you with TONS of transitions and how to do them so that you can come back to this chapter when you’re wanting to implement them into your videos.[d]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 19,
    "header": "Part 4 - Transitions PART A",
    "content": "22. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 20,
    "header": "Part 4 - Transitions PART B",
    "content": "* Swipe L-R OUT, swipe L-R IN (and opposite)\n* Swipe down-up OUT, swipe down-up IN (and opposite)\n* Shake out, shake in\n* Hand swipes L R up down\n* Snap/clap to the camera out, snap/clap to the camera in\n* Mention CapCut transitions[e]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 21,
    "header": "Part 4 - Transitions PART B",
    "content": "23. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 22,
    "header": "Part 5 - Background PART A",
    "content": "Having a good background is almost always slept on by beginners, but it shouldn’t be. You can’t have a hectic or messy background, you always want it to be something well lit, clean, and not distracting from the actual focus of the video, your product. What we’re going to do right now is go through my house and I’m going to show you all of the different well lit,  clean backgrounds that we could use. We’ll talk about why they’re so good and by the end you’ll know how to find clean backgrounds yourself.[f]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 23,
    "header": "Part 5 - Background PART A",
    "content": "23. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 24,
    "header": "Part 5 - Background PART B",
    "content": "* Also remember to find backgrounds outside for them\n* Talk about how it’s important to not just always have the exact same background every video, you want to switch it up a bit and keep things fresh[g]",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 25,
    "header": "Part 5 - Background PART B",
    "content": "24. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 26,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "Short form content is very visual, so remember that you don’t always need to tell people everything that they should be noticing/thinking, you want to show them. For example, instead of saying “this is the most heartwarming gift, look!” for a mother’s day present you’re running, just get a clip of a genuine reaction from your mother. Maybe have her say something like “this is the best gift you’ve ever got me, maybe have her cry a bit, things like that. As humans, we’re smart enough to realize that whatever you just gave her likely is a heartwarming gift, we don’t need it to be told to us. As well as that, if you were selling some product that helps boost your endurance, don’t talk about how “my product is proven to increase your lung capacity by 40% and you’ll be able to run a mile 20% faster…” instead: get clips of a person not in the best athletic gear, trying to be athletic but running out of endurance. Then after that you can get on your lululemon gear, your clean adidas sneakers, and get clips of you or your friend lifting heavier weights than the clips before, running with more confidence than before, etc. If you couple these shots of you struggling before the product but then striving after it with a good story, you’ll be killing it. So remember, TikTok, reels, and shorts are visual platforms. There’s no need to go in depth and communicate your product through text, allow the clips and the product itself to do the talking for you.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 27,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "All of this falls under 25\nLive video creating",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 28,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "* Do this process with them highlighting what we do",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 29,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "This will be one of the more valuable parts of the organic content in this course, so listen up. We’ve told you that you want to find viral videos and recreate them, so to help you as much as possible, Mike’s going to film me live while I recreate this video of the duffle bag. It’s a quality video that, if you were selling this product, you would definitely want to recreate. So let’s go to my living room and I’ll take you behind the scenes of filming this video.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 30,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "Process of editing a good video",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 31,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "* Capcut (quick guide)\n* Sounds\n* Voiceover\n* Transitions \n* TTS\n* Text",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 32,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "Live video editing",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 33,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "* Edit the video we filmed on capcut showing how and highlighting what we went over",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 34,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "Things to know before posting",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 35,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "* Warming up accounts?\n* Optimize for followers so you can get the link\n* Make tiktoks not ads\n* Bio setup\n* IG link VS typing domain \n* Study competitors and replicate what they did right (live)\n* Posting times\n* How many posts a day\n* Hashtags\n* Language \n* Dont film screens much unless giving some example \n* Captions (tagging?)\n* Comment filters\n* Community guidelines\n* Using other people’s content",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 36,
    "header": "Part 6 - Remember to Show, not Tell",
    "content": "26. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 37,
    "header": "Part 1 - Warming up Accounts?",
    "content": "Lots of people in the dropshipping space will tell you that you need to warm up your accounts by having it for a couple days and following lots of people. Me personally, I don’t believe you really need to do anything, but if it helps you sleep better at night I’ll give you some stuff that you can do to feel like you’re “warming up” your tiktok, instagram, or youtube accounts. The first thing you can do is upload 10-20 drafts to show the platform that you’re going to have more videos coming, so the theory here is that you show yourself off as a person who can be trusted for TikTok or something to take you to virality, because you’re not just going to disappear off the platform. Again, i don’t think this is very necessary, and when I did used to swear by this, I saw no difference in performance. The next thing that people like to do is follow lots of accounts, like lots of videos, and comment on them as well. By all means, do this if you’d like, but I’ve not ever noticed a difference in performance. Some people like to wait a day or two after making their account to start posting, so do that if you’d like, but I don’t think it’s necessary. Really in my experience you can just make your new account, make your bio, upload your profile picture and name, then just get to posting.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 38,
    "header": "Part 1 - Warming up Accounts?",
    "content": "27. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 39,
    "header": "Part 2 - Optimizing for Followers at first",
    "content": "On TikTok, you’re currently unable to add a link to your bio unless you have a minimum of 1,000 followers. TikTok’s gone back and forth with this where they let people upload their link before but then don’t, but at the time of recording and for the past year or so, you have to get to 1k in order to add the link to your bio. On reels and shorts you can add it right away, but for TikTok we obviously want to get that link in there as quick as possible so that we can maximize the amount of people who see our videos and can actually buy. What Mike and I recommend you do is optimize your early videos for followers, meaning that maybe you start a series right off the bat where the CTA at the end of every video is to follow for part 2, or follow for more. You can also make the captions of your videos “follow to see more” or “comment what you want to see next and if you’re following us we’ll do it.” Different things like this get people thinking about following you, so they’re more likely to do it and you can get to 1k followers quicker. I don’t always stress about this, but if you’re very keen on getting to that link ASAP then make serieses and make your CTA’s and captions all about followers.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 40,
    "header": "Part 2 - Optimizing for Followers at first",
    "content": "28. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 41,
    "header": "Part 3 - Make TikTok’s, not Ads",
    "content": "A LOT of people get this wrong when making content, they make ads instead of tiktok’s. And when I say tiktok’s i really mean tiktok’s, shorts, and reels, it’s just that tiktok is the most popular but all the laws of content of course transfer to all 3 platforms. But a lot of people will open up the video with their product name like “This is why you need a Flame Diffuser.” But you have to realize, people could not care less about your flame diffuser, they are scrolling on tiktok to be entertained, not to be sold to. And since they’re only there for the entertainment, they’re going to scroll right by your “ad” if that’s what you make your video be. That’s why you need to be making fun, entertaining, unique content. You may think that that’s wrong because then not everyone will want to buy your product, but that’s what the game is. It’s very difficult to make a pushy, ad type video go viral, so the whole gameplan is that you make content that’s actually able to go viral, but you make sure that it’s product focused. Instead of selling people on your bb shooter for example and saying the material it’s made out of and how it’s on sale and they need to buy right away, just show you and your friends having fun with the product, because that is what will make people want to buy it. They’ll see others having fun with it and want it for themself, they won’t see that it’s made out of grade A high quality titanium and say “wow I really want that blaster for that reason.” So keep that in mind. People need to be entertained by your videos, and when they are and your product actually is a winner like we’ve taught you to find, the sales will come, many more than you think I would bet too. So make content, don’t be so selly to your audience.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 42,
    "header": "Part 3 - Make TikTok’s, not Ads",
    "content": "29. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 43,
    "header": "Part 4 - Bio Setup/ig link vs. typing domain",
    "content": "So how should you optimize your bio on your accounts to get sales? Well, what I like to do on TikTok is style my bio this way: I just have a couple arrows pointing down and say “Get your whatever product below!” then I’ll either have the clickable link or if i have less than 1k followers i’ll just have the domain typed out. I find that this is way better than linking an instagram account, where you’re able to have a link in regardless of your follower count because lots of people will still look at your domain, remember it, then go type it into safari. When you just have your instagram linked there though it can take people to some account that barely has any followers so they get turned away from it. Speaking of instagram and youtube, I like to style my accounts the same way. The “get your product below” with a couple of arrows pointing down to an actual clickable link. Then for youtube you can do the same thing but also upload a channel banner like I have right here that just helps funnel even more people to the site.You can make this banner say anything from link in bio to “huge sale going on right now” or whatever you think would get the most amount of people to convert on your link and buy your product. But overall the setup of your bio is pretty simple, and that’s how you want it to. Just keep the funnel as smooth as possible so that you get as many customers as possible.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 44,
    "header": "Part 4 - Bio Setup/ig link vs. typing domain",
    "content": "30. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 45,
    "header": "Part 5 - Study competitors and replicate what they’re doing (live)",
    "content": "31. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 46,
    "header": "Part 6 - Posting times",
    "content": "A lot of you guys may think that you have to post your content at a specific time for it to perform the best, but i’ll be the first one to tell you that this doesn’t matter at all. I literally used to set alarms for 2:37am while in high school because I was testing to see if my videos would perform any better when I posted at that time. Guess what? They didn’t perform any better, and they didn’t perform any worse. So in my opinion, I just prefer to post when most of America is awake, like I’d rather not post at midnight, but Mike posted one time at 10:30pm and the video got 32 million views, so it really does not matter at all. I will say though, space out your posts on TikTok by at least 45 minutes to an hour, but on IG and YT I don’t think it matters at all how much you space out posts by, on shorts i actually will just post back to back most of the time.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 47,
    "header": "Part 6 - Posting times",
    "content": "32. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 48,
    "header": "Part 7 - Hashtags",
    "content": "Do hashtags matter? They do if you’re trying to target a specific audience. For example, if your product is for people who are gym rats or work out a lot, then do things like #gym, #gymtok, #gymrat, #fitness, etc. Again, lots of short form content strategy is just speculation, but i do think that this does help to target the right audience. As far sas general products that kind of apply to everyone, i really think that hashtags do absolutely nothing. I tend to just leave a hashtag if maybe I’m hopping on a trend, like if i’m making content for a general product but the super bowl is coming up and the video is specifically “you need this for your super bowl party” then i’ll do #superbowl. Aside from that though Mike and I have never seen hashtags really uplift your video to virality, just use them if you’re really trying to target a specific audience.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 49,
    "header": "Part 7 - Hashtags",
    "content": "33. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 50,
    "header": "Part 8 - Language",
    "content": "A lot of people don’t really know what type of language they need to use when posting on TikTok. For example, you don’t want to look like this guy and be trying to use some slang that’s not really used on the platform. Also you want to remember that not everyone on tiktok is some teen, there is a massive demographic of adults that use tiktok and will buy products from you. That’s why you don’t want to speak in the tone of some teens or little kids, but instead you can sound more like an adult. Try thinking that you’re speaking in a room of people where the youngest person is 18 years old, and maybe the oldest is around 40 years old. You’re not getting too formal like you’re speaking to senior citizens, and you’re not trying to talk down and extremely oversimplify what you’re saying so that a 5 year old can understand it. So just talk in a semi professional, but more casual tone.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 51,
    "header": "Part 8 - Language",
    "content": "34. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 52,
    "header": "Part 9 - Don’t Film screens so much",
    "content": "One thing that you should definitely know about short form content, at least for tiktok, is that they do not like it when you film screens like your laptop for the whole video and talk about that. And aside from tiktok not liking it, most people overall don’t want to watch a video of a screen on their screen. So unless you really need to point something out on your screen, you really shouldn’t be filming your laptop. You can get more creative than that.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 53,
    "header": "Part 9 - Don’t Film screens so much",
    "content": "35. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 54,
    "header": "Part 10 - Captions",
    "content": "So how important are captions? Well, they may actually be more important than you think. You see, the caption should always have some use to it. Don’t just put something there to have it. You can optimize for comments, likes, shares, followers, watch time, and more with your captions. I’ll give you some examples: if you want lots of people to comment what they want to see next in the series or what you should try with your product, then say “comment what we should try next” or “next video we’ll be doing whatever the top comment says” and different things like that to optimize for that. Any form of engagement is good because it boosts your video even more, so always be going for something. Then you can say “like this video if we surprised you” or “like this video if you think we should do this again”. Remember, the audience on short form platforms are like robots. They’re just being force fed cheap dopamine so you have to tell them exactly what you want them to do, and a lot of the time they’ll do exactly that. Next you can caption your video something like “send this to that one short friend” or “send this to your friend who needs this” or “tag a friend who needs this”, which is great because it’s a comment and also gets someone else to watch and interact with your video. Then for watch time you can say things like “oh my god the person in the blue shirt was the FUNNIEST!” and this will pique a viewer’s interest and they’ll be way more likely to watch longer because they want to see what the person in the blue shirt does. So do this for someone or something that’s at the end of the video, that way the keep watching waiting for that person or thing to happen. So now you understand all of the engagement that you can bring in just by styling your caption a certain way, so don’t ever let one go to waste because depending on what you caption your video you could get so muhc more engagement.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 55,
    "header": "Part 10 - Captions",
    "content": "36. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 56,
    "header": "Part 11 - Comment Filters",
    "content": "People are going to hate on your content a lot if you’re dropshipping. But of course we can’t have people commenting things like “just get it on amazon” or “people are so stupid for buying from this guy, he’s just dropshipping and scamming.” So what we can do on all platforms: tiktok, instagram, and youtube, is ban specific keywords to have the platform filter them out of our comment section. All you have to do is just go to settings and privacy, privacy, comments, then turn on filter keywords. And these are all of the keywords I would ban before making content:\nScammed shitty garbage cheap reselling reseller resell china fake “drop shipped” dropshipping dropshipper dropship scamming scammer fake scam “ali baba” baba aliexpress “ali express” express ali\nThen i would also ban keywords specific to your product if you can think of any, for example if there’s one big competitor in the product that i’m selling maybe i’ll ban their username and some variations of it too that way people won’t be in my comments saying “oh this is just a rip off of X username”",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 57,
    "header": "Part 11 - Comment Filters",
    "content": "37. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 58,
    "header": "Part 12 - Community Guidelines",
    "content": "Rules are stricter on tiktok than on youtube and instagram mike have noticed, so in this part i’m just going to be getting specific to tiktok’s community guidelines here. Don’t be posting anything that isn’t totally work or school friendly. Of course you can get goofy with stuff, but don’t post some weird erotic or racist or homophobic stuff, you can get creative enough without those things and don’t have to create controversy from it. Just make good, entertaining content. Sometimes though tiktok will just tweak out and ban your video or take your account down for no reason, so when that happens you always want to go to the community guidelines violation that you were given and appeal it. Appeal it everyime and always give a good, descriptive reasoning as to why you deserve to get your video or account put back up. If you ever run into this problem and need some extra help, you can dm myself or mike on instagram at @momikechamberlin and @dedolid. We try to get back to all of our dm’s there but if you let us know that you’re a course student and need help trying to get your account back or anything, we’ll help you out the best we possibly can.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 59,
    "header": "Part 12 - Community Guidelines",
    "content": "38. ORGANIC",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 60,
    "header": "Part 13 - Using Other People’s Content",
    "content": "This section can be put very simply. Do not use other people’s videos of the product that you are selling. TikTok IG and YouTube all HATE this, and you can get creative enough yourself, you don’t have to be stealing other people’s content. And if you’re too impatient to wait for your product so you start posting other people’s clips but cut up in your own way, your account definitely won’t be looked at nicely by tiktok. So just use your own clips and don’t overly use your same clips either. Maybe every now and then you can if it’s some GREAT clip of something that you can’t replicate like a great sunset, but if you can easily replicate the shot then definitely do that and keep your content original.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 61,
    "header": "Part 13 - Using Other People’s Content",
    "content": "What to do when a video goes viral",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 62,
    "header": "Part 13 - Using Other People’s Content",
    "content": "* Comment reply video (sell hard)\n* Reply to comments asking where to get it\n* Monitor comments to be sure they all have a positive thing to say about the product",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 63,
    "header": "Part 1 - What to do when going viral",
    "content": "So you’ve been posting great content: content with good pacing, great lighting, it actually makes people feel something, and finally you’ve got one to pop. Every time you refresh your account, your views are going up, you’re getting likes by the second and a few comments every minute. So what do you do from here? Is it time to just kick back and watch the views pile up? Not necessarily. Now that you’ve got a video to start gaining traction, one thing that you want to start doing is monitoring the comments slightly. Although we’ve set up keywords to be banned and not hurt our brand image, some comments will still slip through just hating on the product, calling us dropshippers, telling people to get it on Amazon and more. This goes for all of the big 3 platforms, but let me give you specific gameplans for all 3.\n        TikTok. I have the most experience with this so let me cook here. What we’re going to do when a product is going viral is be replying to people asking where to get it with “link in bio” and other variations of that. As well as that, right as you see the video is starting to pick up some traction, I want you to either 1. Find a comment near the top that says something product focused. Something like “I need this” “I want this” “where to buy”, etc. If a comment like this is in roughly the top 10 comments or so, hold onto that for one second. If you 2. Don’t have any comments like this, once you notice views are picking up, go onto a burner account and comment something like “omg I NEED this, where do I get one??”. So now this is what we’re going to do. Take this comment, hold down on it, and click reply with video. From here we can post a very ad-y video, meaning a video that is completely product focused and screams at people that we are the sellers of this product and that they should buy because we’re running a big sale. Since we’re taking a comment and replying to it with a video, it should rank it at the top of the comment section, so now anyone who comes across your viral video and opens the comment section (which is most people who are intrigued with your video) will see that video reply you did. This is an extremely effective thing to do when you have a video going viral because your ad-y video is piggybacking off the views from your viral video, and the reason we have to piggyback is because there’s no way an ad-y video that’s all about our product and very selly is going to blow up on TikTok. So by doing this we funnel however hundreds of thousands to tens of millions of views we get to a very salesy ad, that pushes people to buy our product. A good script is something like this: “Hey [INSERT NAME] we’re glad you love the [INSERT PRODUCT]. We’re actually the original creators of it and you can get one from the link in our bio! And for anyone else who’s maybe on the fence about getting X product, just keep in mind that we have a 50% off sale running right now, something that we’ve never done before and may not do again, so right now’s the perfect time to buy! And don’t worry, if you want a refund within 30 days we’ll give you one, no questions asked! So again get your X product for 50% off for a limited time from our website linked in our bio!” See how effective this is? You have urgency with the 50% off limited time sale, you have trust, saying that you’ll refund them if they want one, and you’re VERY clear as to where to buy one of these. This is exactly what you want to do when you’re having a video go viral because it’ll help you convert views into sales so much more, you’d be shocked at how many people come across viral videos of products and just say “wow, I’d love to get one but I don’t know where I’d get it.” So by having this video that shakes them and wakes them up to the fact that you’re the actual seller is huge. Also, be sure to caption your video “LINK IN BIO” because on TikTok, that text will pop up in the comments above your actual video reply, so that’s just an added way to get people to understand that they can get the product from the link in your bio. Aside from this strategy, that’s about all I do when I have a video blowing up on TikTok. It’s at this point where I’ll kind of just monitor the comments and watch the sales pour in.\n        As far as Instagram goes, you can actually pin comments here. As I’m recording this now, you’re unable to pin comments on TikTok, just Instagram and YouTube. But anyways, what I would do is pin your own comment saying something like “Get your own [INSERT PRODUCT] for 50% OFF from the link in our bio! Valid only for today!” This comment perfectly explains where to get the product and it makes people feel that they have to act now before the sale is over. Aside from that you can also reply to comments with videos on Instagram too, so do the same thing that you did on TikTok. Again, that’s all I like to do and I’ll just monitor the comments a bit and watch the sales roll in.\n        For YouTube, you currently can’t reply to any comments with a video, but what you can do is pin comments. So what I like to do is comment “Get your own X product from the link in our bio OR at exampledomain.com.” The reason I also give the website in that comment is because YouTube shorts isn’t a place where people are as used to channels having links in their bio, definitely not as much as TikTok and Instagram at least. But that’s really all that I’ll do as well as monitor the comments a bit.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 64,
    "header": "Part 1 - What to do when going viral",
    "content": "How to continue going viral",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 65,
    "header": "Part 1 - What to do when going viral",
    "content": "* Rinse and repeat (maybe give “brother” angle I used for momike videos) (I talk about this when i go over spinners and hyte soles so read that to not repeat the same stuff)\n* Strategy of 2-3 videos that have worked and 1-2 new ideas (hytesoles method)\n* Don't create videos for followers but for new audiences",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 66,
    "header": "Part 1 - How to KEEP going viral",
    "content": "To keep going viral, it’s a pretty simple formula. And for this example i’m assuming that you’ve already had videos get into the hundreds of thousands to millions. What you’re going to want to do is a combination of rinse and repeat as well as testing some new angles. Here’s what I mean by this. Let’s say that you’ve had 1 video go viral. If you’re making 4 videos per day and posting them to your TikTok, Instagram, and YouTube, what Mike and I like to do is make 2-3 of the videos remakes of the viral video, then have 1-2 new ideas. Basically the thinking behind this is that you have a proven angle that’s gone viral, so you don’t want to go away from it. That’s why you make those 2-3 remakes to keep squeezing out possible views. And when I say remakes I mean that maybe the first remake of the day is 20 seconds longer, maybe the other remake is a voiceover instead of the AI voice. Basically you’re taking the same principles that took your video viral but kind of just packaging it in a new way. Then for your new ideas, that’s really all it is, new ideas. These are the videos you post where you’re basically throwing things at the wall and seeing what sticks, and trust me, after long enough of doing this, you’ll see what sticks. And that’s the beauty of this method is that if you have a few angles that are proven and currently are bringing in views, you can just keep making those remakes all day long and be bringing in great views. Also don’t worry that you’re making remakes and maybe your audience will get tired of it, because we’re focused with every video we make to bring in a new audience through a viral video. Of course this isn’t the case if you have a personal brand or something because with that you obviously don’t want to just be posting the same content, but since it’s just a dropshipping account, it really doesn’t matter for reputation.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 67,
    "header": "Part 1 - How to KEEP going viral",
    "content": "How to scale with potential creators",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 68,
    "header": "Part 1 - How to KEEP going viral",
    "content": "* Tabs and top shelf method\n* People reposting and tweaking videos on all platforms",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 69,
    "header": "Part 1 - How to potentially scale with creators",
    "content": "So how can you really scale organic short form marketing for your dropshipping store? It’s something that has been popularly called the “tabs method”. Basically what this method is is paying people a retainer to post let’s say 1 video per day for a month, and also having them earn commissions with every order that they bring in. So what you can do to a brand new person to content is say something like “Hey, I’ve been posting organic content for my product for 6 months now and have 25 winning marketing angles that have been proven to go viral time and time again. Can I pay you $200/month plus 15% commission on every order that you bring in to basically recreate these video frameworks and post them to brand new short form accounts?” Then as time goes on and maybe they grow their account a bit you can up their retainer to $500/month, then maybe $1000/month, you get the jist of it. But the idea here is that you’re reinvesting into the business to have people do that busy work that you wouldve been doing of editing for HOURS. Really this is the only way that you can get out 20+ videos per day, but that’s what’s so exciting is that if you scale and get tons of creators doing this, you’re having tons of videos be posted that have gone viral time and time again. You basically unlock constant virality with your product.",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 70,
    "header": "Part 1 - How to potentially scale with creators",
    "content": "How to target US internationally",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 71,
    "header": "Part 1 - How to potentially scale with creators",
    "content": "* Sim cards\n* Why you would want to target US\n* GAP help",
    "category": "Organic",
    "source": "course"
  },
  {
    "id": 72,
    "header": "Part 1 - How to target the US internationally",
    "content": "[a]PART A\n[b]PART B\n[c]Can just record all of this, then in post you can screen record checking out the camera settings\n[d]PART A\n[e]PART B\n[f]PART A\n[g]PART B",
    "category": "Organic",
    "source": "course"
  }
]